[
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "price": "$47.84",
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "by far the best brand that we have found. We love the fact that you can use your amazon prime & it gets here in a matter of days. Sometimes these will go on sale & we stock up because we have had really good results from this filter. It is true to time. Meaning, I have wrote the dates of the day we replace the filter on the filter itself and each one has lasted us exactly 6-6.5 months & we use it A LOT! it is our main source of water in the house because we are iffy about consuming the tap water! Great purchase. You can truly taste the difference it makes!",
                "review_header": "by far the best brand that we have found",
                "review_rating": "5.0 ",
                "review_author": "Meticulous Mom Reviews",
                "review_posted_date": "27 Jun 2017"
            },
            {
                "review_comment_count": "",
                "review_text": "The product was delivered as expected and is as per description. This is meant to replace the earlier model by Pur ( see photos attached). After replacing, during first one or two quarts there may be name sound as the water gets inside the filter, which seems normal and goes away immediately after. The instruction says to throw way first 4 gallons of water after replacing.",
                "review_header": "Certified replacement for Filter 1 : W10295370A",
                "review_rating": "5.0 ",
                "review_author": "MS",
                "review_posted_date": "01 Jun 2017"
            },
            {
                "review_comment_count": "",
                "review_text": "I have bought two of these filters and they only work for a few gallons and then they clog, they have also caused my ice maker to sputter and now I only inconsistently get ice, hopefully this will stop eventually. The people posting positive reviews must not have my fridge WRS325FDAM02. Stick with the old blue filters. I find it hilarious how much whirlpool is pushing these overpriced filters, when the old blue filters work fine. My next fridge will not be a whirlpool, I will be sure not to buy one that does not take drop filters. My father in law has also had difficulties since using the new white filters as well. His filter does not even stay locked in the fridge, it just keeps getting ejected from the filter holding mechanism.",
                "review_header": "This filter only causes problems...",
                "review_rating": "1.0 ",
                "review_author": "Ashley",
                "review_posted_date": "08 Jan 2017"
            },
            {
                "review_comment_count": "",
                "review_text": "I have only installed this and had it one day but what can I say, it's a water filter. It does exactly what it is supposed to do. I'm pretty sure all the people complaining about the taste and The water being foggy don't follow directions. You have to flush a lot of water through first (4 gallons). The water only looks foggy because a filter is hundreds of thousand porous holes squeezing water through and that's how it's filtered. So for the first few days you are getting all those little bubbles from the porous holes. It goes away after a couple of days. Tastes good",
                "review_header": "Good product",
                "review_rating": "5.0 ",
                "review_author": "Ryan S.",
                "review_posted_date": "26 Apr 2017"
            },
            {
                "review_comment_count": "",
                "review_text": "I was skeptical about buying the water filter after all the negative reviews, but it surprised me. My fridge was new and this is the first time I had to change the filter. Whatever filter was already IN the fridge had a terrible plastic taste so I was concerned that it would stay around with the new filter. To my big surprise it was much better. I only drink spring water and have drank from the filter and liked it- it had no after taste or plastic taste anymore. I did have some air bubbles following the filter change but it does go away after a little while. I made sure to run the water before the first use (as directed) although I didn't measure the water so was it exactly however many gallons??? No idea! I am very happy with my purchase and will only order this filter for my Whirpool fridge.",
                "review_header": "Great replacement filter for Whirlpool fridge",
                "review_rating": "5.0 ",
                "review_author": "Sammie D.",
                "review_posted_date": "22 Mar 2018"
            },
            {
                "review_comment_count": "",
                "review_text": "This item works. I purchased a different product that was half the price for a two pack, but they did not work on my whirlpool side by side fridge/freezer. All these aftermarket products say they fit and work and have correct part numbers, but the in expensive ones do not work on my fridge. This one works. Costs more,but it's well worth it. Update: 6 months later, this filter is perfect, and it's been the only one that works on my whirlpool refrigerator. No problems, works grest",
                "review_header": "Good item works on whirlpool, very good",
                "review_rating": "4.0 ",
                "review_author": "Starman",
                "review_posted_date": "27 Sep 2017"
            },
            {
                "review_comment_count": "",
                "review_text": "I went through about six different water filters from various brands trying to find one that would work for my four year old Kenmore refrigerator on my last refill. Up until that point I had been successful using 3rd party filters. This time there was a change in the design for the filters by all manufacturers. Each one would fit fine but I could not get any pressure at all, just a hammering sound. This official Whirlpool filter worked right away, producing better water flow than I have gotten with any of the other filter manufacturers. I didn't notice any difference in the taste of the water. The filter was troublesome after the first night and I had to adjust it a few more times before it was just right to keep the water flowing. No problems in the month since. I knocked one point off since it is a little pricey.",
                "review_header": "The only one that worked for me",
                "review_rating": "4.0 ",
                "review_author": "Chris C",
                "review_posted_date": "09 Jan 2018"
            },
            {
                "review_comment_count": "",
                "review_text": "I entered my serial number from my refrigerator as required to find the proper filter, it said this filter would work for my refrigerator, it was wrong, could not have been more wrong. They do make the filter for my Kitchenaid fridge, but they don't sell it here. Unless you can tell what you're ordering by the package photo, I would not rely on their set up for entering your serial number off your appliance or model number here.",
                "review_header": "50/50 you'll get the wrong filter.",
                "review_rating": "1.0 ",
                "review_author": "Thrifty",
                "review_posted_date": "23 May 2017"
            }
        ],
        "url": "http://www.amazon.com/dp/B00UXG4WR8",
        "name": "EveryDrop by Whirlpool Refrigerator Water Filter 1 (Pack of 1)",
        "ratings": {
            "5 star": "65%",
            "3 star": "5%",
            "2 star": "4%",
            "1 star": "14%",
            "4 star": "12%"
        }
    },
    {
        "price": "$9.06",
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "As an amateur astronomer, I've done a lot of research about light pollution. That led me to research about how light affects sleep. Here's the summed-up version so you don't need to read all those scientific papers I have: - Blue light is great for being awake - that's why you wake up with a blue sky (read about melanopsin and melatonin on Wikipedia) - Blue light is not good for sleep; in the 470 nanometers range, that suppresses melatonin (a key hormone for sleeping well) - Humans (and other animals) evolved to sleep in the dark - or, at the darkest, full Moonlight (just 0.1-0.3 lux of light) - Longer wavelengths of light were the only source of light at night for most of human history (fire / candles) - Tablets / phones / screens / LED's and many CFL bulbs have strong blue wavelengths that are messing with our circadian rhythms and suppressing melatonin, because they have wavelengths shorter than 530nm - 540nm So what to do in our modern world? Wear these glasses before bed. Natural melatonin production would have occurred with our ancestors starting with the onset of sunset. Wavelengths of light from the setting sun would have shifted to red, and fire or candles were usually the only form of light available. Those are both relatively dim, and in longer wavelengths. Today, our \"connected\" world has a LOT of blue light. It's messing with our sleep patterns, because our bodies evolved to only see red/orange/yellow light at night, NOT blue light/shorter wavelenghts. THESE GLASSES BLOCK THOSE MELATONIN SUPPRESSING WAVELENGTHS. Put them on a couple hours before bed. For me, I start getting drowsy about 90 minutes after wearing them. The trick is DO NOT take them off without closing your eyes or being in a dark room (a room with ONLY a dim red light would work too, as your melanopsin won't trigger melatonin suppression with red light). So when changing for bed, close your eyes when removing your shirt if you have to pull it off over your head or put your night time clothing on. Then leave these on until you turn out the light for sleep. And be sure to sleep in the dark too, or wear a sleep mask. Small amounts of light can still affect your melatonin (well, anything brighter then full Moonlight - yes, even a blue LED on your computer). You can watch TV with these on, check your phone, read your tablet, work on your laptop - just note that colors will look weird. Blue looks black. Yellow looks white. Greens look weird. And the glasses aren't exactly stylish. But if you sleep better, who cares? They work. And while you're at it, make sure your home's lights (and business if you own one) aren't shining into other people's homes or apartments. Too much light at night is what makes these things necessary in the first place. We don't need all this light at night; these glasses are just a band aid to help; what we really need is smarter outdoor lighting - aimed down, at the ground, at the proper color(s) so we aren't suppressing others melatonin. According to a Harvard study, the U.S. loses $63 BILLION dollars per year due to American's insomnia. Artificial light at night messing up people's sleep is undoubtedly part of that - let's fix that so these glasses aren't as necessary. Oh, and did these glasses work for me? An emphatic YES, they did. 5 nights (so far) of excellent sleep and well-rested mornings. And I am NOT a morning person! They work - just use them the right way, and be sure you're not doing other things that might hurt sleep (too much caffeine, lack of / too much exercise right before bed, sleep apnea, etc.) So if it's not a medical condition, do the right things, wear these, and get better sleep.",
                "review_header": "Blocks the blue so your body naturally produces melatonin - just be careful with a few things",
                "review_rating": "5.0 ",
                "review_author": "DF",
                "review_posted_date": "16 Sep 2014"
            },
            {
                "review_comment_count": "",
                "review_text": "I have been an electronics junkie all my life. Unfortunately, I have also been having terrible insomnia and light sleep problems for most of my life. These glasses have helped change that. The build quality is honest to the $9 price. I have a narrow face and these glasses fit me perfectly. They block out all the blue light ruining your natural \"come down.\" You will experience a more natural circadian rhythm while still indulging in the modern electronics. Installing \" Flux. \" and wearing these glasses are recommended for all computers and phones. They even work well as safety glasses while doing yard work due to the wrap around fit. Highly recommended for students, workaholics, computer junkies, late night TV addicts, and lab assistants. Try them yourself!",
                "review_header": "Sleep Like Nature Intended",
                "review_rating": "5.0 ",
                "review_author": "Jeremy",
                "review_posted_date": "11 Aug 2015"
            },
            {
                "review_comment_count": "",
                "review_text": "I can sleep at last! These orange Uvex Skyper glasses worn every evening - in combination with the Luminette Bright Light Theraply Glasses worn every morning - have totally transformed my life! Prior to buying these two items my sleep cycle had been appallingly since uni days. Years of working on a laptop all night in a brightly lit office had ruined my body's ability to regulate its sleep. I'd be bursting with energy at midnight, and then still powering away at dawn. It was easy to stay awake for 36 hours at time, but almost impossible to sleep. Mornings were just awful, and I'd feel lacklustre all day ... until about 7pm when my energy levels would begin to rise again. Over the years I had often tried to reform my sleep, but without any success; clearly, my brain was simply not producing melatonin. A few months ago I decided to start an experiment to see if cutting out blue light at night, and then adding bright blue light in the mornings, could overcome the chronic sleep problems. The science seemed valid, so I hoped it would work on me. I bought both the Uvex Skyper orange glasses (to block blue light in the evenings) and the Luminette glasses (to simulate bright daylight in the mornings) and used both diligently every day as part of a program to reform my sleep. Here's what I experienced. 1. Within a couple of weeks of wearing the Uvex Skyper glasses I started getting sleepy at around 11pm, like normal people do!! 2. After just a few mornings of wearing the Luminette glasses I began to enjoy waking up. I couldn't wait to pop on my \"happy glasses\" as they made me feel wonderful! Now, more than 2 months later, I wake every morning around 7am feeling bright and cheerful. 3. The quality of my sleep has been completely transformed. Only three months ago I would wake every half hour and then lie awake for another two or three hours; now I sleep soundly the whole night through! Based upon my experience, here are the key conclusions I'd to share with others. * If an inability to wind down or fall asleep is your main problem, then the orange Uvex Skyper glasses (around $9) should be your first purchase - because if you can kick-start your melatonin production at night, then you will sleep better and wake happier. * However, if you struggle to wake up and you feel sluggish for hours afterwards, then the Luminette glasses could be transformational for you (as they were for me). I used to hate mornings ... and now I love them! * You still need to be sufficiently self disciplined to use the specs diligently. E.g. if I forget to wear the orange glasses for a few nights, then my old habit of staying awake all night quickly returns. I'm writing this review jointly for the Uvex Skyper Blue Light Blocking Glasses (for evenings) and the Luminette 2 SAD Bright Light Therapy Glasses (for mornings) because I used both over the same time period and it isn't really possible to tell which of them has contributed most to resolving my sleep and wake problems.",
                "review_header": "Sleeping well and waking happy! My chronic sleep problems have been resolved!",
                "review_rating": "5.0 ",
                "review_author": "AE",
                "review_posted_date": "17 Oct 2017"
            },
            {
                "review_comment_count": "",
                "review_text": "Well I am super skeptical when it comes to things like this ...how can glasses help you sleep better you know ? My boyfriend has a pair of these and swears by them so I finally bought some. I have severe insomnia so what did I have to loose right. I got the glasses put them on and within the first hour I noticed I was getting tired and it was only 9 pm usually I don't even start to get tired until 2-4 am so this what weird to me it's not been about a week and man do these things work it's almost conpletely fixed my insomnia now I get tired around 8 -10 so I would highly reccomend these ...they are kinda big and goody looking but worth it",
                "review_header": "Well I am super skeptical when it comes to things like this",
                "review_rating": "5.0 ",
                "review_author": "Cf777",
                "review_posted_date": "14 Oct 2015"
            }
        ],
        "url": "http://www.amazon.com/dp/B000USRG90",
        "name": "Uvex Skyper Blue Light Blocking Computer Glasses with SCT-Orange Lens (S1933X)",
        "ratings": {
            "5 star": "56%",
            "3 star": "12%",
            "2 star": "7%",
            "1 star": "6%",
            "4 star": "19%"
        }
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "price": "$40.49",
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I have been using Viviscal for a little over a month now, and it is a nice natural product, it is basically a vitamin for your hair. I use it together with Minoxigaine Minoxigaine by Hairgenics FDA Approved Hair Growth Formula with 5% Minoxidil Plus Powerful DHT Blockers which is a combination of rogaine's minoxidil with other hair growth ingredients that really work, I definitely notice less shedding and some new hair growth.",
                "review_header": "I Like Viviscal",
                "review_rating": "4.0 ",
                "review_author": "S Matthews",
                "review_posted_date": "18 Dec 2017"
            },
            {
                "review_comment_count": "",
                "review_text": "I do not believe the item being sold here is the authentic Viviscal Extra Strength Pill. I read the reviews before purchasing, which questioned the authenticity of this product, but chose to ignore it since the vendor was viviscal. BIG MISTAKE. While packaging may change, and the items with older packaging are commonly reduced in price; i do not believe this is the same product as what is sold from other vivscal retailers. First, after taking this product for 3.5 weeks, I saw no change in hair loss. Second, after taking this product for 3.5 weeks I developed a horribly dry/rashy scalp. It was unbearably dry, flaky, and itchy. I decided to stop taking viviscal. My scalp eventually recovered. believing this product not to be the real deal, I purchased it at Target for $35.00. The packing is almost exactly the same but as mentioned in a previous review, the lot numbers are different. Amazon viviscal is alpha numerical, and targets in just numerical. The pill packaging is different which could fall under the packaging my vary description. The biggest and most disturbing difference is in the pill itself. The pills from target which is a verified Viviscal retailer, are denser, a totally different color and have a grainier look to it. This made me wonder what did I buy from Amazon? The pills look and smell different despite the Supplement Facts being EXACTLY the same. I have no idea what I was ingesting believing it to be Viviscal, and I would strongly recommend that NO ONE buys this from Amazon. Target might be a little bit more but it is worth it for an authentic product that does not potentially give you an awful reaction!",
                "review_header": "NOT THE SAME ITEM SOLD BY OTHER OFFICIAL VIVISCAL RETAILERS. RIP OFF.",
                "review_rating": "1.0 ",
                "review_author": "Amazon Customer",
                "review_posted_date": "30 Jul 2017"
            },
            {
                "review_comment_count": "",
                "review_text": "I've been using this on and off for a few years. I noticed in the last year it was not working as well, my hair was not growing as fast. I read other reviews stating it wasn't the same product as sold by the company or say another distributor like Walgreens or CVS. I went to Walgreens to purchase and sure enough the pills look, taste, and smell differently. I saw more results in less than one month of taking the pills from the store than I did in 3 months with the ones from Amazon.",
                "review_header": "Suspicious of Product Authenticity",
                "review_rating": "1.0 ",
                "review_author": "L_H",
                "review_posted_date": "19 Dec 2016"
            },
            {
                "review_comment_count": "",
                "review_text": "Amazon.com has allowed false reviews to flourish on this product page. I have called their attention to one that uses MY IMAGE without authorization (username: Kate, who has also posted a number of other seemingly false reviews on numerous unrelated products), and Amazon has refused to take it down. The reviews you are reading for this product are largely FAKE, as are many others on Amazon.com, most likely. I have used this product and found it to be lacking.",
                "review_header": "FAKE REVIEWS on this page; product doesn't work",
                "review_rating": "1.0 ",
                "review_author": "William Brennan",
                "review_posted_date": "14 Dec 2016"
            },
            {
                "review_comment_count": "",
                "review_text": "Please do not buy, these are fake, only God knows what they actually put in these pills for human consumption, pills began turning black after a few days of opening. Also when compared to another pack I bought from a store, these had no batch code and other stuff were very different from the original.",
                "review_header": "Pills turned Black",
                "review_rating": "1.0 ",
                "review_author": "Amazon Customer",
                "review_posted_date": "14 Sep 2017"
            },
            {
                "review_comment_count": "",
                "review_text": "It's been about 20 days and I've only been taking one a day (at night) because the tablets were causing my skin to break out a lot. I'm not sure if I've noticed a difference but a good friend said my hair texture was less frizzy. My nails are super strong and long, however. I am confident that I'll see improvement in my hair with continued use. Update: The pills in first batch I ordered were wide and flat and made in Ireland (supposedly). I definitely have noticed a difference in my hair quality since I've been taking them. Just ordered my second box and the packaging looks like a knockoff, as well as the pills being smaller in diameter and thicker and made in the US (supposedly). I emailed Viviscal the lot numbers and expiration dates so hopefully they can confirm which batch is real. I will be returning these pills pending their response. There is a reason the price is significantly cheaper than the pills at the store. (First order is the box/pills on the right and the lot number on the bottom; second order is left/top. I think the second one is the fake.) Update #2: I checked the lot numbers and expiration dates with the company and they told me that both boxes were legit but they have two factories, which would account for the differences in the pills. However, the second box (made in the US) is giving me really bad, unrelenting acne. The first box from Ireland also caused breakouts but that subsided after a week or so whereas this time it won't stop. If I can consistently get the pills made in Ireland, I'll keep taking them cause they definitely do seem to be making some difference. If not, the acne is a dealbreaker.",
                "review_header": "Ireland-made pills are better if you can secure them. Watch out for breakouts!",
                "review_rating": "3.0 ",
                "review_author": "Renee",
                "review_posted_date": "28 Mar 2016"
            }
        ],
        "url": "http://www.amazon.com/dp/B01CT3K500",
        "name": "Viviscal Extra Strength Hair Nutrient Tablets, 90-Tablets",
        "ratings": {
            "5 star": "49%",
            "3 star": "11%",
            "2 star": "8%",
            "1 star": "16%",
            "4 star": "16%"
        }
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "price": "$6.10",
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Ordered this while drinking mai tai's at the hibachi restaurant. I said to my girlfriend, that thing is funny, I wonder if its on amazon, and sure enough it was and now whenever she cooks I grab it off the counter, squirt her with it and yell \"Fire man fire man!!\" Family and guests think I'm weird, I think it's hilarious.",
                "review_header": "that thing is funny, I wonder if its on amazon",
                "review_rating": "5.0 ",
                "review_author": "PrimeAddict",
                "review_posted_date": "07 Jan 2016"
            },
            {
                "review_comment_count": "",
                "review_text": "The local Japanese steakhouse uses one of these to put out the fire on the grill (as a joke). Since my 7 year old son thinks this is hilarious, we decided to get him one as a gift. He loves it and plays with it for a few minutes at a time. I'm not sure how durable it is, but definitely a cute gag gift with some play-ability.",
                "review_header": "Gag gift - perfect for my 7 year old boy",
                "review_rating": "4.0 ",
                "review_author": "Jennifer",
                "review_posted_date": "26 Feb 2016"
            },
            {
                "review_comment_count": "",
                "review_text": "So I searched and searched for a reasonable doll for boys to assist in potty training. I have used \"Total potty training in a day\" with my daughter and it worked like a charm! (AMAZING) so being a boy, I know things are different down there so to help with the visual part, I thought this could help. Its totally cute and funny and pees like a foot long stream several times before needing to be refilled. I also bought the potty princess with poop in the potty. We havent started the actual process as the book describes but this is one small step for little boys. Cute joke toy also...we laughed and laughed. Thats the trick with potty training...to be fun!",
                "review_header": "Potty doll for boys toy",
                "review_rating": "5.0 ",
                "review_author": "kellyjlo",
                "review_posted_date": "31 May 2013"
            },
            {
                "review_comment_count": "",
                "review_text": "Got this for my daughter since she liked one just like it when she was little. Her gramma had one an all the grandkids loved it till it broke. After they passed they didn’t remember it broke an wanted it as a memory",
                "review_header": "Got this for my daughter since she liked one just like it when she was little",
                "review_rating": "5.0 ",
                "review_author": "L. A. Panfil",
                "review_posted_date": "26 Feb 2018"
            },
            {
                "review_comment_count": "",
                "review_text": "We have a griddle on our backyard porch where we often make fried rice for the kids. Bought this for my husband to use and give the kids a few laughs just like they do at hibachi restaurants. Works great and the kids absolutely LOVE it. Hilarious and fun!",
                "review_header": "Great for outdoor hibachi grills",
                "review_rating": "5.0 ",
                "review_author": "Rocky140",
                "review_posted_date": "22 Jun 2017"
            },
            {
                "review_comment_count": "",
                "review_text": "This toy is so fun for a potty training boy! He wants to make it pee all the time and it's a great teaching tool to keep pee in the potty target than making a 'mess'.",
                "review_header": "Potty training genius",
                "review_rating": "5.0 ",
                "review_author": "Ryan Sleight",
                "review_posted_date": "22 Oct 2016"
            },
            {
                "review_comment_count": "",
                "review_text": "Sent it to my mom for Xmas cause she's a nerd and loves gag gifts. She liked it a lot, she gets unsuspecting people to pull the pants down, and god knows what they expect to happen, but I think it's fair to say they are usually surprised. She says it squirts pretty far, like 3 feet+. I haven't seen it myself since I live far away, but i can say my dorky mom loves it.",
                "review_header": "Works as expected",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer",
                "review_posted_date": "24 Mar 2015"
            },
            {
                "review_comment_count": "",
                "review_text": "This is brilliantly hysterical yet sublime in its subtle approach to humor. Not quite slapstick in a kitchy Three Stooges approach to comedy, but for more instrinsically pure. And I think its a pig, so makes it even funnier. Pluses for shooting very far, go range, good capacity can hold a lot of water. Very accurate.Pants are spring loaded, so very smooth action. No grit or snap when the trigger breaks. easy to fill. Looks built to last and has a timeless style so will stay fashionable. Paint looks very durable.",
                "review_header": "Squirting Wee Thing",
                "review_rating": "4.0 ",
                "review_author": "snazzy frazzy",
                "review_posted_date": "13 Sep 2017"
            }
        ],
        "url": "http://www.amazon.com/dp/B0067N91V8",
        "name": "Rhode Island Novelty Classic Gag: Squirting Wee Pee Boy Squirter Quantity of 1 Novelty",
        "ratings": {
            "5 star": "70%",
            "3 star": "9%",
            "2 star": "2%",
            "1 star": "7%",
            "4 star": "12%"
        }
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "price": "$3.67",
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "We purchased 3 of these for everyone to carry. We participate in a lot of outdoor sports and needed an emergency signalling device that was small, failure resistant and powerful. These do not have the pea inside, so they won't fail if wet or frozen. The other consideration was how loud with little effort. If you are injured, it wouldn't be easy to get a great big puff to fire off the whistle. It's quite audible with a little exhale, and super loud if you can really blow. We carry these when we snowmobile in case someone is lost or slides down a hill or out of sight. A great piece of mind for very little $$$'s",
                "review_header": "Super loud without a lot of effort",
                "review_rating": "5.0 ",
                "review_author": "wny-rider",
                "review_posted_date": "28 Feb 2014"
            },
            {
                "review_comment_count": "",
                "review_text": "Bought this for my disaster kit, since it seems that a whistle is a must-have item according to the Ready gov site. It seems pretty sturdy, and is pretty loud as any good whistle should be. Although, everyone knows that zombies are attracted to loud sounds, so while I may be heard loud and clear when I am signaling for help by blowing on this whistle, I may also be drawing unwanted attention to myself in a zombie apocalypse :)",
                "review_header": "Blow your whistle with caution in a zombie apocalypse",
                "review_rating": "5.0 ",
                "review_author": "I only have pies for you",
                "review_posted_date": "08 Jan 2018"
            },
            {
                "review_comment_count": "",
                "review_text": "A great loud whistle. No pea or ball in this which is what I was used to with whistles not that it was a problem. As a matter of fact I like it that it doesn't have anything inside it. This has a long lanyard and is perfect for emergencies. I also think it is a great item for anyone to have especially for the women who go shopping by themselves or at night. A blow on this whistle will send anyone away and draw attention. I rate this a 10+ for a safety item. At $2. and change every family should own a few of these.",
                "review_header": "Awesome Safety Item",
                "review_rating": "5.0 ",
                "review_author": "David F.",
                "review_posted_date": "14 Sep 2016"
            },
            {
                "review_comment_count": "",
                "review_text": "+ Bright color + Sturdy lanyard + Nice and loud + Small so I can carry in my pocket or running hip pouch + Inexpensive...so I bought one when I'm on runs and a dog decides to come after me or when I'm at the dog park and agressive dogs get into it (loud noise like whistle or air horn does wonders). Also got one for my daughter to carry with her for emergencies. My boys already had one from boy scouts as a whistle is a great survival tool when you're off hiking. Only improvement is the metal ring that attaches lanyard to whistle could be a slightly better quality, but since this was only $1.64 at the time, I'm not deducting stars",
                "review_header": "Works great!",
                "review_rating": "5.0 ",
                "review_author": "Super2018",
                "review_posted_date": "16 Mar 2015"
            },
            {
                "review_comment_count": "",
                "review_text": "I bought this whistle to use on my kayaking trips on the intercoastal in South FL where there are many boating channels where boats and jet skis fly by at high speeds. This has come in handy almost every time, as there tend to be some careless boaters out there and this inexpensive, loud level of protection is a must have for anyone in this position. My wife is also a lifeguard for hire and she has used it during her jobs. The decibel level produced has he keeping the pool on lockdown with little to no effort! All around, must have for any occasion!",
                "review_header": "Super loud and a lifesaver!",
                "review_rating": "5.0 ",
                "review_author": "Mickey White",
                "review_posted_date": "30 Sep 2016"
            },
            {
                "review_comment_count": "",
                "review_text": "This is the worst made whistle. The cheapest plastic, which nearly even snapped as I tried to blow on it. Made in China... in the worst possible way. Does not match the picture, so something is wrong here.",
                "review_header": "Thinnest, cheapest plastic ever.",
                "review_rating": "1.0 ",
                "review_author": "Stephen T.",
                "review_posted_date": "13 Sep 2016"
            },
            {
                "review_comment_count": "",
                "review_text": "This safety whistle works and is cheap, so what is not to love? It seems to be made well, so for the price, I'd say it is hard to beat.",
                "review_header": "It's a safety whistle and it is cheap",
                "review_rating": "5.0 ",
                "review_author": "Capt. T",
                "review_posted_date": "13 Feb 2013"
            },
            {
                "review_comment_count": "",
                "review_text": "Nice and loud, durable, and it won't rust. This is a decent-quality whistle that I use with my hunting partners so we can keep in contact without scaring away game. They have helped us find each other in the woods, and we sometimes use them just to help us keep track of where each other is, while still hunting. I've also used them to get a bear's attention several times, when I wanted them to see me along salmon streams in Alaska. That usually is enough to encourage the bears to move off and let me pass. I also keep one on my boat, as a signaling device. Electric horns on boats are notorious for corroding and failing, and the Coast Guard considers these whistles as adequate, which has helped me pass boarding inspections a couple of times. For me, its just cheap insurance that I'll be able to get someone's attention if I need to, or to avoid a ticket in case the Coast Guard wants to do an inspection. I like plastic better than metal for a whistle because its usually more comfortable to use if its cold out. Let me know if my review was helpful.",
                "review_header": "Good whistle with several uses",
                "review_rating": "4.0 ",
                "review_author": "AKMonkey",
                "review_posted_date": "14 Sep 2016"
            }
        ],
        "url": "http://www.amazon.com/dp/B004LRBLSI",
        "name": "Shoreline Marine Emergency Survival Whistle",
        "ratings": {
            "5 star": "73%",
            "3 star": "6%",
            "2 star": "3%",
            "1 star": "6%",
            "4 star": "12%"
        }
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "price": "$165.99",
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "We have been using the Infant Optics DXR-8 video monitor for 1 year now and felt we could now give an accurate review. If you're in a hurry, the summary of this review is that this camera and monitor are great and the customer service provided by the company is outstanding (see below). So stop hunting and trying to weigh all the baby camera/monitor reviews and get this camera and monitor if it provides you with all the features you want. You really aren't going to find anything better. We initially purchased this camera and monitor after spending way too much time pouring over all the options available to us, trying to find the BEST camera and monitor for our new baby. Our main concerns were getting a good camera with quality night imaging, good sound and an easily viewable monitor. We also felt we didn't want a system that sent our image feed off to some remote server where it would be stored for some period of time for whatever analytics that the company performed. The Infant Optics DXR-8 fulfilled all our wishes. Set-up: Setting up the monitor and camera was easy. We followed the directions and had no issues at all pairing the camera and monitor. The camera was actually very light and we hung it up on the wall so it could capture the entire inside of the crib. Again, it was very easy. USE: The monitor had a clear picture in day light and more importantly, at night. The monitors range was sufficient for us and we had no problems even after we moved baby out of our room and into her own as our rooms were on different floors. The monitor always worked great and we could always see the baby when we wanted. The controls on the monitor were easy to use and the buttons were large enough to use in the middle of the night with no light or light from monitor alone. We appreciated the simplicity, particularly when sleep deprived. In terms of battery life for the monitor, we had no issues once we figured out our schedule. We used it pretty much throughout the day unplugged and kept it plugged in overnight night by our bed, pretty much like our phones. Occasionally we ran out of battery but not frequently enough where we thought there was something wrong. It was all we could ask for. Customer Service: Now for the best part. Coming up on a year of use, the power button on the monitor began to stick. We started having issues turning the monitor on and off and putting it to sleep. It got to the point where the monitor turned on and off by itself sporadically which was problematic at night. We wrote an email to Infant Optics explaining the situation and hoping for a repair or replacement. We received a response on the very same day we wrote (Sunday!) explaining that a replacement monitor would be easiest. So we sent the monitor back through the mail and sent them a picture of the package and the receipt. Given this proof, they were able to send out our replacement before they received our broken monitor and we received the new monitor in the mail in 2 days! But that’s not all. We accidentally sent back the battery for the monitor which we were instructed not to do (The monitor still works without a battery if plugged in). So we wrote again explaining our mistake. Infant Optics immediately got back to us again and sent out another battery for the monitor. 2 days later we had a new battery for our new monitor. Conclusion: Honestly, we could not ask for better treatment. This is the type of costumer service that actually makes you happy and reaffirms that the Infant Optics camera and monitor was the right choice for our family. You can’t go wrong with this camera and monitor. It works great and it is backed up by outstanding customer service that provides peace of mind all new parents should be afforded.",
                "review_header": "This camera and monitor are great and the costumer service is even better.",
                "review_rating": "5.0 ",
                "review_author": "Lando",
                "review_posted_date": "29 Oct 2015"
            },
            {
                "review_comment_count": "",
                "review_text": "Side-by-side comparison of the Samsung SEW-3043W and Infant Optics DXR-8: First, I just want to say that I am an actual customer that purchased both of these knowing that I would be returning one. It is our first baby together, and we wanted to make sure we had the best possible monitor. The mommy-to-be and I wanted to test both of these units side-by-side to see how they compared to each other. Samsung initially seemed like the better choice as it had the 5” screen compared to the DXR-8’s screen of only 3.5” The Samsung also had music playback on the camera in the baby’s room (4 different lullaby song choices), and a small night light on the top of the camera (which you can turn on and off). However, when it came to actually functionality, the DXR-8 was by far the BETTER choice. The on-screen touch controls of the Samsung lagged and were difficult to use. The Samsung’s touch screen is far different than the touch screen on their cell phones, their touch screen has little sensors throughout that you can see if you look at it closely. The Samsung also went out of range (as noted in many of the pictures) when compared to the DXR-8. In one picture I took both units outside. The DXR-8 went over 200’ from my house (and probably could have gone much further). The Samsung went out of range before I even got out the door. The Samsung unit failed at three different areas in my house. Trust me when I tell you that I didn’t make the test easy either. I had three doors shut and about four walls separating the handheld units from their cameras. I took them throughout the house, side-by-side, at the same time. Save yourself both time and $$$ and just start with the Infant Optics DXR-8. Additional pros of the DXR-8 include the on-screen temperature display of the baby’s room, and a brighter display (the Samsung display was rather disappointing, I thought it would have been the far better display, but it simply was not). The only con of the DXR-8 is the smaller screen size, but it is sufficient. Both units functioned about the same when it came to night vision.",
                "review_header": "Side-by-side comparison of the Samsung SEW-3043W and Infant Optics DXR-8",
                "review_rating": "5.0 ",
                "review_author": "Michael Marshall",
                "review_posted_date": "02 Mar 2016"
            }
        ],
        "url": "http://www.amazon.com/dp/B00ECHYTBI",
        "name": "Infant Optics DXR-8 Video Baby Monitor with Interchangeable Optical Lens",
        "ratings": {
            "5 star": "73%",
            "3 star": "4%",
            "2 star": "4%",
            "1 star": "8%",
            "4 star": "11%"
        }
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    },
    {
        "reviews": null,
        "reason": [
            "Robot Check"
        ]
    }
]