[
    {
        "reviews": null
    },
    {
        "ratings": {
            "4 star": "10%",
            "2 star": "6%",
            "5 star": "66%",
            "1 star": "8%",
            "3 star": "10%"
        },
        "url": "http://www.amazon.com/dp/B00OACD9CU",
        "price": "$9.37",
        "name": "Set Of Ten Finger Hands Finger Puppets",
        "reviews": [
            {
                "review_posted_date": "22 Mar 2016",
                "review_author": "Baby hands Johnson",
                "review_header": "No regrets",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "After waiting two long days, for these to arrive..Today was finally the day. I must say this is (baby) hands down the best purchase I've made. I'm free to drink, smoke and write this helpful review! Buy them and you too will have hilarious snap chats..and be able to rub your friends faces with your tiny hands."
            },
            {
                "review_posted_date": "18 Sep 2016",
                "review_author": "Lucas Lee",
                "review_header": "Wrong proportions",
                "review_comment_count": "",
                "review_rating": "2.0 ",
                "review_text": "The product description says 5 right and 5 left hands. I ended up with 7 right hands and 3 left hands. The product itself is exactly what I wanted, but I'm disappointed that I didn't get the correct proportions."
            },
            {
                "review_posted_date": "10 Nov 2015",
                "review_author": "Void",
                "review_header": "I love these but they wear out quickly and have an inconsistent quantity of each hands.",
                "review_comment_count": "",
                "review_rating": "3.0 ",
                "review_text": "While I love these Finger Hands, I do have some issues with them. The paint wears down quickly and make the hands look darker and more dirty, although it makes the veins on the back look more real. I received 7 right hands and 3 left hands. I don't know if the description was changed from when I ordered, but the current description says only right hands. It would be nice to have an equal number of left and right hands. I like having the thumbs match my thumbs. We take these everywhere and either get excitement and smiles out of people or get awkward and creeped out looks. I love the details with the veins and fingerprints though. They are a little tight on my fingers, but I think most people won't have this issue."
            },
            {
                "review_posted_date": "09 Jun 2017",
                "review_author": "Aymeezus",
                "review_header": "A set of 10 but hands, awesome gag toy!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Ordering this, you get 10 tiny hands — 5 right hands and 5 left hands. I've seen many reviews where they get an uneven number of right and left hands but that was not the case for me; I guess I was lucky. It seems these rubber hands are made by the company \"MCPHEE\". Considering these ARE rubber hands, they do get dirty quite easily and will require cleaning with soap. Color does not rub off! Still a funny gag toy! (The hands are really detailed by the way) In conclusion: BUY AT YOUR RISK: - because they might come in uneven numbers of right and left hands - the wrong hand color PROS: Hey, in the end, you still got 10 mini hands, so smile!"
            },
            {
                "review_posted_date": "02 Oct 2016",
                "review_author": "WWCitizen",
                "review_header": "Gotta Hand it to ya...",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "These are hands-down the best additions to my office desk at work that I think I've ever had. And I have to hand it to the manufacturer; I give 'em a high 5 for their product. My co-workers really appreciate it even more now when I give them a little hand on a project."
            },
            {
                "review_posted_date": "27 Oct 2017",
                "review_author": "yuri branzburg",
                "review_header": "Dishonest. You do not receive a \"set\"",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "Extremely dissatisfied! I received 6 right hands, 4 left hands, and one of them is brown while the others are all white. This is an assortment, not a set. I want my money back."
            },
            {
                "review_posted_date": "06 Dec 2017",
                "review_author": "wayne",
                "review_header": "i LOVE these, i am a so-called artist and i ...",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "i LOVE these, i am a so-called artist and i have ALREADY used the bad-boys in several assemblage pieces and i am just so THRILLED!!! they look so authentic and they are quite mailable for working into tight spaces. i totally caught attention to several people saying that MIRACULOUSLY this company is so stoned that they MISS correct Amount of left / right hands and thus bought extras in anticipation. and true to form, blessum, i got an odd set of pairings, no matter... just plan aheads and stop your whining at the amazing price for quality stuff!! oh and i was at some airport and the TSA guy was wearing these at security hahahahahahha, so very funny and a great conversation ensued on our OMG i have those hands too!!"
            },
            {
                "review_posted_date": "02 Feb 2016",
                "review_author": "jc",
                "review_header": "So funny, so creepy",
                "review_comment_count": "",
                "review_rating": "2.0 ",
                "review_text": "Received seven left hands and three right hands. I was rather disappointed not to have even numbers of each appendage! Otherwise, they're exactly what they seem."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "14%",
            "2 star": "7%",
            "5 star": "47%",
            "1 star": "24%",
            "3 star": "8%"
        },
        "url": "http://www.amazon.com/dp/B00990Z4W6",
        "price": "",
        "name": "Crosley CR8005A-TU Cruiser Portable 3-Speed Turntable, Turquoise",
        "reviews": [
            {
                "review_posted_date": "24 Jun 2017",
                "review_author": "Serena",
                "review_header": "Buy something else",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "Spent the money on this after so much debate and research and REALLY wish I wouldn't have. Poor sound quality turned into virtually no sound for no reason. The headphone jack is definitely not meant for auxiliary (loud buzz & clicking) and the output didn't give me any additional volume. I wasn't traveling with this thing, so I have no idea why it would have suddenly decided to just stop making making sound. Frankly, I don't see the value in investing the time or or additional money into finding out. I can just help you. I have never purchased anything that went so badly so quickly in my life that was so expensive from such a reputable name. In my opinion you could do better buying anything else at all from any other other brand."
            },
            {
                "review_posted_date": "29 Dec 2015",
                "review_author": "Shana A Miller",
                "review_header": "Don't buy this piece of junk!",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "This is a cute little machine, but it's built like crap. It worked well for about a week, then it sounded slowed down and warped. This was a Christmas gift for my daughter. She was very excited to get it, but it has been nothing but a problem. She took it to college with her so I couldn't get it back until a month later to send it back & that's all Amazon gives you for returns. Amazon is ok until you need to return something. They won't help you, so you are left dealing with the manufacturer, what a joke. This will be the last time I buy anything from Amazon. In today's world there are better online stores. They are to big to care about the customer anymore. They take your hard earned money & sell you a piece of China junk."
            },
            {
                "review_posted_date": "02 Mar 2016",
                "review_author": "Ashley",
                "review_header": "this is one fine product. I see a lot of bad reviews",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Im not new to portable record players. For 80 bucks, this is one fine product. I see a lot of bad reviews, but I have no complaints. I had the Crosley playing for hours, with different records ranging from soft to a little harder. It played them all fabulously. I have had no problem with skipping, but if you do, there are easy fixes for it. Toss a weight onto the arm and youll be good. I had ordered it in turquoise and it is LOVELY. The sound quality isnt bad either. Not extremely loud, but loud enough. If you're looking for something incredible, youll probably be spending upwards of 300 dollars on one thatll have no flaws, but for the price of this, it makes a unforgettable gift or experience."
            },
            {
                "review_posted_date": "21 Sep 2016",
                "review_author": "Violette",
                "review_header": "Great deal for the price",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "Reading other reviews I did not expect much from this turntable. Once unpacked I plugged it into my home stereo receiver and tried out a few records. I recommend using external speakers if possible since the on-board speakers are small, and you are listening to vinyl. The reason I am giving 4 stars is that this unit is very light and the switches could have a stronger more friendly design. The briefcase top also comes very close to the bottom of the playing album. While it did not rub on the albums I have played, an older warped album may strike the lid when spinning so use caution if you are playing a lot of vintage records."
            },
            {
                "review_posted_date": "28 Feb 2016",
                "review_author": "Revnyce",
                "review_header": "Spin and Drop",
                "review_comment_count": "",
                "review_rating": "3.0 ",
                "review_text": "Stylish case and very compact. The needle is mediocre as it skips rather easily even with the record completely clean from dust, lint, etc. Consider connecting to auxiliary speakers for better sound quality. The integrated speakers are borderline useless and sounds awful but for the price this is a lot better than other ones I have seen or heard. Do not buy this if you are looking to truly experience vinyl or analog format music. Buy a real turntable with an amplifier and speakers. Do it the right way and not because you want to tell people you have vinyl records. Don't expect the world with this unit."
            },
            {
                "review_posted_date": "28 Jul 2015",
                "review_author": "Emma",
                "review_header": "I love this record player",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I recently had broken my record player that a friend had given me and had NO idea where to get a new one. The first place to start looking was obviously Amazon. I got on and found this pretty quickly by searching for the color. It was shipped quickly, in time for us to play our new record the day we got it. For not having any external speakers connected, the sound quality is great. I have it connected in my living room and can hear it from my bedroom while I'm getting ready. You can hook up external speakers if you'd like to, so that's also a cool option. All in all, I give this a 5 star rating. I can't think of anything I'd like to change and I know it also comes in different colors. It's a great product for music lovers."
            },
            {
                "review_posted_date": "12 Aug 2017",
                "review_author": "Hannah JY",
                "review_header": "Cute and Simple",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "Works great, simple, super adorable! The plug is a bit big and heavy while the wire is prettt flimsy but I've never had any problems with it but I hardly move it from my side table, the record hangs off the side a bit more than shown in photos but still adorable and simple for having a handful of records. Would not recommend if you're a serious record collector or wanting to be one."
            },
            {
                "review_posted_date": "31 Jan 2017",
                "review_author": "Matthew Shelp",
                "review_header": "You get what you pay for.",
                "review_comment_count": "",
                "review_rating": "2.0 ",
                "review_text": "I suppose it's ok if you really don't care about sound quality at all. It looks good, but that's about it. The quality of the player is pretty low, all plastic low-cost parts. It was already skipping the record using it just once, so the weight of the needle is all off. But the worst part is the built in speakers, they are absolutely awful. I have standards in my sound quality or I suppose I wouldn't care. I wouldn't recommend unless you only care about look and poor sound quality doesn't bother you much."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "11%",
            "2 star": "3%",
            "5 star": "75%",
            "1 star": "8%",
            "3 star": "3%"
        },
        "url": "http://www.amazon.com/dp/B01F24RGZK",
        "price": "$48.00",
        "name": "JBL Clip 2 Waterproof Portable Bluetooth Speaker (Teal)",
        "reviews": [
            {
                "review_posted_date": "25 Jun 2016",
                "review_author": "Rick",
                "review_header": "Great speaker in a small size",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "This speaker is super clear and very loud for its size. It doesnt buzz when you turn it up all the way and has good range from bass to acoustic. It sucks that it doesnt show the battery percentage but i did notice that it does show on my phone. Idk about android but with iphone if you pull down the notifications it shows the exact percentage."
            },
            {
                "review_posted_date": "29 May 2017",
                "review_author": "Den",
                "review_header": "Surprised dropped from 87 feet",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Great speaker. I was working inside glass Tower at 87 feet high and accidentally dropped it down and for my surprise it was still working and I didn't loose Bluetooth connection to speaker. So I had it playing music from there till the end of my shift. When I went down to pick it up it only had minor ding on the side and front screen felt off. I'm still using it thanks JBL for good quality!!!"
            },
            {
                "review_posted_date": "17 Jul 2017",
                "review_author": "PeekabooJake",
                "review_header": "Great sound packed into a small beast",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I've been using the JBL clip 2 for a little while now and can say this thing packs a punch for such a small lite weight device. I can clip this bad boy to my belt loop and can forget it's there because of how lite it is. It's great for outdoor water activities such as hanging by the pool or Kayaking. There isn't a whole lot of bass but I'm fine with that because it makes up with how crisp and clear the sound is. Great addition for any one looking to spice up their summer fun"
            },
            {
                "review_posted_date": "21 Aug 2017",
                "review_author": "Edward",
                "review_header": "Works and sounds great. I had a sound link mini",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Bought this about a month ago to have a portable speaker hang onto my tool belt. Works and sounds great. I had a sound link mini, which sounds fantastic, but it was just too damn heavy to carry around and I also wasn't able to charge it via USB (needs to plug into outlet). So I bought this and plenty of other small, USB charged portable speakers and the Clip 2 BY FAR sound the best out of the other ones of which I've returned. For its size, it's handles bass very well with very little distortion, even at high volumes, all while having the clarity music deserve. And believe me, this thing get loud! It's extremely light, 10 hr battery, USB charged, waterproof, can also be daisy-chained, and all under 50 bucks. Again, for ITS SIZE AND PRICE, it's the best little speaker out there hands down."
            },
            {
                "review_posted_date": "26 Feb 2018",
                "review_author": "Michael Braislin",
                "review_header": "Great Sound per Pound! Great for hiking, backpacking, and camping.",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Amazing sound and value! I've contemplated Bluetooth speakers such as Bose, but this fits my on-the-go needs better with its easy carabiner attachment for clipping to packs while backpacking, camping, and boating - hence the waterproof feature is essential although I haven't really tested its H20 limits. Beyond the convenient Bluetooth connectivity, it also has an (out) aux sound chord for plugging into other none-Bluetooth capable devices such as older iPods. I use mine for connecting to my iPhone or older iPod for on-the-go movie time while camping. There is a reason I see this device sold everywhere - it's got more sound per pound. Would recommend and buy again."
            },
            {
                "review_posted_date": "19 Aug 2017",
                "review_author": "jonesvox",
                "review_header": "Best Design, Quality, and Features in a Tiny BT Speaker",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "For a palm-sized BT speaker, this thing is amazing!! Add the fact that it's waterproof and can daisy chain to another Clip 2 for stereo and it's pretty perfect!! I travel as a freelance audio mix engineer and this is so handy to clip to my backpack. I purchased a second one because my girlfriend liked it so much. I tried the daisy chain feature and synced both of them in stereo and was quite impressed!! And you can spread them apart for great stereo separation. Some reviews make complaints about the bass response but I feel it's very good considering the small form factor. Buy one, you'll be happy you did! Buy two and float them in the pool!!"
            },
            {
                "review_posted_date": "02 Dec 2017",
                "review_author": "Fabiana Valletta",
                "review_header": "Best/smallest speaker I’ve owned!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "This are one of the best speakers I’ve had! It’s a small speaker, but it’s pretty powerful (unless you’re trying to use it for a 100 person party) It had a clip on the top, so you can hang it from anything you want. I always put it in my shower, or in the door handle, or my bag. You can put it anywhere. It brings an aux cord as well, it’s super versatile. If you don’t want to use your Bluetooth you can just connect it through the aux cord."
            },
            {
                "review_posted_date": "15 Apr 2018",
                "review_author": "J_Owens",
                "review_header": "Great speaker, especially for the price. There is one thing to take not of regarding the audio cable.",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Great speaker for the price. I wish there was a little more bass, but it probably wouldn't be possible based on the size and price. At least the bass that is present isn't distorted. The bass and highs sound very good, but the mids might be a little low, but again the speaker sounds really good. The speaker is loud enough for a small room, but wouldn't fill up a large room. The speaker is definitely beautiful and the clip is nice and sturdy. The material it is made out of feels nice to the touch and seems to be high quality. One thing to note, this may be different than some Bluetooth headphones you may be used to regarding the built-in audio cord/cable. The Sony Bluetooth headphones I have are not required to be turned on or connected via Bluetooth to anything if I have an audio cable plugged in to them directly. That is not the case with this speaker though. Even if I have the speaker connected via the audio cable to an MP3 player, it must be turned on and it will automatically pair/connect with your phone. This can be annoying if you are using a separate MP3 player and a phone call comes in to your phone which was previously paired to the speaker. Not a deal breaker, but something to make note of."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "10%",
            "2 star": "5%",
            "5 star": "71%",
            "1 star": "9%",
            "3 star": "5%"
        },
        "url": "http://www.amazon.com/dp/B00NGV4506",
        "price": "$74.99",
        "name": "Ninja Professional Blender (BL610)",
        "reviews": [
            {
                "review_posted_date": "15 May 2017",
                "review_author": "japanvle",
                "review_header": "Great blender, excellent customer service",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I bought this blender exactly 1 year ago and I am now writing my review on it. I never write reviews but my experience with Ninja's customer service was so exceptional that I felt compelled to write one. I'll start by saying the Ninja is an excellent blender for $70. I blend frozen fruit with it every single day. It pulverizes everything into a smooth drink every time. About 1 week ago, for an unknown reason, my blender stopped working; when I went to turn it on the power button just started blinking instead. I wasn't sure what this meant so I emailed Ninja. The representative was kind, attentive, and replied to my emails extremely promptly (sometimes within minutes). I let him know what happened, and all he asked me for was: 1) the blender model number 2) where I purchased the blender and the approximate date of purchase 3) the warranty number (which happens to be just a 4 digit number engraved on the prongs which plug-in to your electrical outlet) As soon as I gave him that information, he emailed me with a confirmation-of-shipment of a new pitcher along with a tracking number. The new pitcher arrived in 3 business days and my blender is working like new again (I never figured out what was wrong with the old pitcher or why it was preventing my blender from turning on). I love companies that provide exceptional customer service and I will never purchase another blender other than Ninja. Thank you Ninja!"
            },
            {
                "review_posted_date": "25 Sep 2016",
                "review_author": "Rob",
                "review_header": "BLADE HOUSING - OPERATOR ERROR",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "To all the people giving this blender a poor review because they were harmed by blades \"popping out.\" The blender lid locks in and the lid itself has a pouring spout that you are supposed to open to pour the drink or smoothie out with. Personally I like how easy it is to remove the blades. Makes for easy cleaning if you're making something more than a smoothie where you have to take the entire lid off, you can reach in, grab the head of the blade attachment and just easily pull the blade out. It's a fantastic product and you can't blame the product for a \"design flaw\" when it's simply OPERATOR ERROR."
            },
            {
                "review_posted_date": "02 Aug 2016",
                "review_author": "The Wheels Go Round",
                "review_header": "Smoothie magic",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "There are some products that just change your life. I wanted to get in on the smoothie thing, and there simply is no other way to do it than with a blender, and no better blender to do it with. The blender is mostly plastic, but it doesn't feel cheap. It is very secure. It locks onto the base with a satisfying click. The lid locks down with a similar click. Unless you have heard both clicks, the blender won't start. And good thing. The blades are very sharp. They are angled to create a vortex that instantly turns any fruits and vegetables inside into viscous liquid. I like that the spout has a lid that locks open so you can pour easily. The blades come out so that they can be cleaned easily, along with the inside of the decanter. I saw that another buyer was cut when the blades \"flew out\" during cleaning. I have looked carefully and my blade assembly does not appear to be capable of flight or even mild levitation. Nonetheless I lift it out carefully, and if I am going to use the blender again I just rinse the blades; if I want the blades completely clean I use the dishwasher and not my hands. It has been a long time since I used a blender. I stopped because they sucked. Old blenders leaked out the bottom. They were hard to clean. They had a ton of different buttons for blending speed with labels that required a thesaurus next to the cookbook. And however I parsed the gradations of perturbation between \"emulsify\" and \"macerate\", they didn't actually blend. What was at the bottom of the blender became angry and confused while whatever was in the top two thirds of the decanter remained beatifically serene. This blender has high, medium, and low settings. You can pulse. It is loud, which I take to be a feature and not a drawback. Even more than my espresso machine, this blender is extremely effective at ending unwanted conversations. For particularly persistent interlocutors, use the pulse setting. Neither my kids nor I particularly like fruits and vegetables and as a result we don't get nearly enough. And yet I can put in 10 bananas, two cartons of strawberries, two of blueberries, a bag of spinach (yes, spinach!), a cup of plain Greek yogurt, one interrupted conversation ... and: ambrosia! The decanter is huge, and yet between the three of us we can and do empty it in one meal. Yay!"
            },
            {
                "review_posted_date": "23 Jul 2017",
                "review_author": "girlinpinkwaders",
                "review_header": "Blender jar exploded!",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "I've had my Ninja for about 18 months. I loved it. Used primarily for smoothies with frozen fruit. The other day it exploded on me and tore a hole through it. I have contacted Ninja. They didn't seem too concerned about it, and when I pressed them and offered to send them the defective blender jar so they could figure out the defect, they didn't seem very interested. The email they gave me was incorrect so I have to call them again to try and pursue this. I don't want another one, I just want them check it out because obviously there is an issue."
            },
            {
                "review_posted_date": "04 Jun 2017",
                "review_author": "PHIA N VANG",
                "review_header": "Poor Plastic, broke within 8 months with little usage! DO NOT RECOMMEND! Costly warranty.",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "Bought on October 6, 2016. One of the clip that locks the lid on broke off after minimal usage. The broken clip prevents the blender lid from locking and deactivating the safety, rendering the blender useless. Their warranty states that I will have to pay $19.95 to cover the cost of returning a replacement, factor in the cost to ship the broken blender to them, that would be 40-45% of the original purchase price. I would not recommend this blender. Stick with glass container versus plastic."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "10%",
            "2 star": "5%",
            "5 star": "66%",
            "1 star": "14%",
            "3 star": "5%"
        },
        "url": "http://www.amazon.com/dp/B003YFI0O6",
        "price": "$17.99",
        "name": "Oster Cordless Electric Wine Bottle Opener with Foil Cutter, FFP",
        "reviews": [
            {
                "review_posted_date": "25 Jun 2015",
                "review_author": "DaveyG",
                "review_header": "3 YEARS later......#amazeballs",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I ordered this for my smokin' hot GF back in 2012... fast forward 3 years later -- this $20 wine opener is still with me and my smokin' hot GF is now my smokin' hot wife. I never thought either one would be with me for this long... but life is good. We like to have a good time... I mean...we effin' get down on some wine. So this bad boy probably pops open a new bottle every 2 days. It has stayed plugged in to our wall for over 3 years now (I halfway expected the battery would have burned out by now, but nope!). We haven't even had to replace the screw yet --- still works like new --- I'm shocked and impressed this $20 opener has faithfully lasted this long. Often times you get what you pay for (I know b/c I'm cheap... like... the OG of cheap) --- but this is an exception to that rule --- I have no idea why anyone would pay $50+ for another \"more recognizable\" brand --- this is packed with all the quality you could ever need. I probably sound like a sound like a PR rep from Oster, but I had to write a review of this little guy when I saw him sitting unrighteously unreviewed in my past orders."
            },
            {
                "review_posted_date": "26 Feb 2016",
                "review_author": "LopsidedMidget",
                "review_header": "Great while it lasted",
                "review_comment_count": "",
                "review_rating": "3.0 ",
                "review_text": "I really liked this opener. It worked really well and looked pretty sleek. I'm in the unique position where I've purchased quite of few of these as gifts for family members and two for myself (my family loves wine). Why two for myself? Well, as it gets older the batter stops holding a charge quite like it used to and we had one run out battery with a cork in it. I'm sure that you're sitting there thinking \"LopsidedMidget, don't be a dummy. Just recharge it and *poof* you are absolved of your issue.\" This would be true.. with nearly any other brand. However, Oster charges by sitting on the stand and a cork gets in the way of that happening. You either have to take the whole thing apart, or invest in a new opener once this happens to you. Of the five that I have purchased for myself and family only one of them is still functional - and that's because my father quit drinking a year ago. So, why do I still give it three stars? Well, it's $20 and works well until it's inevitable failure. You'll very likely get between 1-2 years out of this guy (hopefully) and you won't regret your purchase once you use it... until you need to open wine and don't have an opener.. I've since moved on and now use the Onzeri one and have realized that this Oster model feels a lot more solid. The Ozeri sounds/feels like it's wheezing out its final breath whenever we use it to open wine. It has lasted longer, but it's feels like it has the motivation of a teenager being forced to do its chores whenever we use it. The saving grace for the Ozeri is that the charge is a cable that attaches to the outside and it doesn't rely on a base to do this, so even if it does with a cork in it we can still charge the opener and eject the cork."
            },
            {
                "review_posted_date": "29 Jan 2018",
                "review_author": "thomas b.",
                "review_header": "Don't bother. Horrible Customer Service. Poor Product.",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "When I first saw this wine opener I had a, \"I've got to have it moment.\" After purchasing this item I was in heaven, opening wine bottles was a breeze, the foil cutter is awesome, and I love the long battery life on this opener. I loved this product so much I bought multiple for gifts for friends/family members. 6 months later, the down button (which removes the cork from the bottle) stops working, knowing that Oster aka Sunbeam Products aka Jarden Consumer Solutions has a 1 year limited warranty (stated in product manual) I wasn't worried. I emailed customer service about my issue, 3 weeks later I got a response requesting information in order to process the return. The same day I respond to the email with all the information asked, another week goes by without a response. I email customer service to make sure they received my email with all my information and not only did they let me know they did receive my email but the product was \"no longer covered under warranty\". I responded to customer service with the exact words from their handbook stating that their product has a one year warranty and have yet to get a response. So if you are thinking about purchasing this wine opener, keep scanning for something else. This is not the one for you. TLDR; Don't buy this product, it is not made well and customer service isn't interested in fulfilling their warranty."
            },
            {
                "review_posted_date": "27 Nov 2017",
                "review_author": "Yordana.",
                "review_header": "Best $17 I’ve ever spent....after I read the manual!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "At first I thought mine was broken but I was doing it wrong! 1. Cut the wrapper with the cutter that it comes with (little loop hooked onto the back of the charger stand). 2. PUSH DOWN ON THE WINE OPENER WITH PRESSURE while pressing the down arrow button as you hold the bottle as well. 3. Once the wine opener feels a little loose, that means the cork is out. 4. Remove the wine opener to reveal the open bottle. 5. Press the upward arrow to release to cork. CHEERS!"
            },
            {
                "review_posted_date": "24 May 2017",
                "review_author": "Alice",
                "review_header": "Beware don't waste your money!",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "I had to change my review here. I bought this product in May and it already is a lemon which is a polite way to put it. It worked well enough for about six weeks but now refuses to open bottles. I say this meaning when you press the down button (which pulls out the cork) nothing happens. No sound, no motion, no nothing. I have this thing fully charged too. I contacted the seller and requested a replacement and have heard radio silence from them."
            },
            {
                "review_posted_date": "25 Jan 2018",
                "review_author": "A. Person",
                "review_header": "product broke after 14 months of light use, and the manufacturer refused to step up and replace it",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "This flimsy product stopped working after about 14 months of light use. I contacted the manufacturer, Jarden Consumer Solutions, through its website, noting, among other things, the date on which I purchased the product. After 11 days, Jarden finally got back to me by requesting additional information, such as certain codes written on the product. I provided that information promptly, and received another email requesting yet additional information. I provided that information. I then received an email from Jarden stating that there was nothing that they would do and that they would not replace the product. I was especially disappointed to receive such a response after having been sent on a wild-goose chase for the various information they had requested from me. I responded to Jarden by expressing my dissatisfaction and by asking them to stand by their product and replace it. They responded by saying that there was nothing they would do. Stay away from Oster and from Jarden brands."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "18%",
            "2 star": "5%",
            "5 star": "60%",
            "1 star": "10%",
            "3 star": "7%"
        },
        "url": "http://www.amazon.com/dp/B07BWQ622V",
        "price": "$23.54",
        "name": "Iron Gym Total Upper Body Workout Bar",
        "reviews": [
            {
                "review_posted_date": "20 Apr 2016",
                "review_author": "Maniak",
                "review_header": "Works great with toilet paper !!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "The inside of my door frame width was too narrow for the bar to get a secure hold so I put on a couple of 1000 ply toilet paper rolls at each bar end. And if I ever find I'm out of toilet paper, I can always have a pair of extra rolls on the pull up bar. Perfect"
            },
            {
                "review_posted_date": "17 Jan 2017",
                "review_author": "K. Sweeten",
                "review_header": "Bought mine in November and used only intermittently. The ...",
                "review_comment_count": "",
                "review_rating": "3.0 ",
                "review_text": "Bought mine in November and used only intermittently. The plastic inside the tip broke and projected to the floor Head and knee injured. The plastic is not durable enough and there is no warning since it is covered by the rubber stopper. Really should be out of metal. Extreme caution when using!!! I am going to try to get my money back or return it"
            },
            {
                "review_posted_date": "20 Apr 2013",
                "review_author": "Josh B",
                "review_header": "Plastic WILL eventually break -- BEWARE",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "Owned and used this thing daily for about 4 months until the plastic bar snapped where one of the bolts are located. Just be careful using this, luckily my feet were beneath me when it broke or I'd be in the hospital. @The company that makes this --------- PLEASE READ That plastic bar NEEDS to be metal!!!!"
            },
            {
                "review_posted_date": "21 Jan 2018",
                "review_author": "Himeko Shima",
                "review_header": "Good pull-up bar, but certain precautions necessary",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "I purchased this in August of 2015 and it has served its purpose well. Assembly was easy. If I remember correctly, it took me less than 30 minutes. I don’t use it for anything else other than pull ups and chin-ups, but I’m sure it’ll be good for pushups and sit-ups. I question how effective dips would be on this since it seems a bit too low to do a full movement dip. It has handled my weight (145 lbs) well and has not started to bend or sag. I do have a couple of complaints, the padding on the bar where it meets the door frame should be thicker. Mine degraded without me noticing and the actual solid bar started to push against my doorframe. Now my doorframe is damaged. I recommend putting a sock between the doorframe and the bar to provide more padding for protection. My other complaint is that the flat piece that goes against the wall above the doorframe could discolor your wall. It did mine. I recommend putting something in between the wall and the flat plastic part to prevent against this. Other than that, this is a well built product that performs as advertised."
            },
            {
                "review_posted_date": "29 Jul 2017",
                "review_author": "E. Reeve Fritchman",
                "review_header": "Check your door molding before buying this product--it may not fit",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "It doesn't fit every door and it won't work for me. The molding above my doors is 1\" thick/4.25\" and that's too high--it appears this product was designed for smaller molding. The top horizontal bar must rest *on top of the molding*; otherwise, it won't stay up when you're pulling up on it (while a lot of your weight will be redirected into the door frame, there's still a downward vector which the molding above the door absorbs). The photo demonstrates how the unit hangs, and I'm about 0.25\" shy of fitting. Sigh. Also, this product probably won't work on anything other than flat molding: the top bar is only 0.75\" and probably doesn't provide enough offset for decorative moldings, which would probably get crushed. These size limitations aren't on Amazon's web site or in the manual, which I read before unpacked the product; this is clearly a vendor miss. Other products from this vendor note a molding size restriction of 3.5\". Update: vendor contacted me and offered a completely satisfactory solution, so I'm boosting my rating. Customer service matters!"
            },
            {
                "review_posted_date": "05 Jun 2017",
                "review_author": "DagFamily",
                "review_header": "Grips don't stay attached, can't do pull-ups.",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "Grips have come unattached to the frame after only 1.5 months, making product basically unusable in pull-up position. However, that's beyond the warranty return date allowable, so all I know to do at this point is leave a negative review. It would be nice if there was a way to contact the manufacturer. Will remove/update review if this situation can be rectified."
            },
            {
                "review_posted_date": "31 Dec 2017",
                "review_author": "Amazon Customer",
                "review_header": "Do not feel safe using it!",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "I read the reviews and thought this might be a great addition for my morning work outs. I assembled it as instructed and placed the wedge on the correct side of the frame. The bars are not flush and noticebly off, when trying to seat the flat side aginst the frame, one side is braced and the other not sitting flat. In trying to adjust it, the flimsy wedge broke, and I am at my wits end to figure it out. I can’t, so next step is to call the service number included in the package and I was sent to voicemail with a full mailbox. The is no way I am putting my full weight on that thing (as is) and I did not purchase it to do floor exercises."
            },
            {
                "review_posted_date": "15 Feb 2016",
                "review_author": "Bill",
                "review_header": "Pull-ups, pull-ups, pull-ups",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I'm very happy with this. It fits my frame perfectly. I have done approx 600 pull-ups on it in 2 weeks. It has not weakened or degraded and has left no marks as of yet on my door frame. Assembly was super easy. I am 170 lbs and it holds me well. For what I paid I couldn't ask for more. *Update* The soft hand grips are beginning to wear. At this point I have roughly 2,000 pull-ups on it with continued daily use. The hand grips are the only noticeable sign of wear on the unit. The outboard rubber pads have now left faint black marks on my white door frame which I assume will clean off with soapy water. Still I am impressed with this budget pull-up bar."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "12%",
            "2 star": "4%",
            "5 star": "65%",
            "1 star": "14%",
            "3 star": "5%"
        },
        "url": "http://www.amazon.com/dp/B00UXG4WR8",
        "price": "$43.70",
        "name": "EveryDrop by Whirlpool Refrigerator Water Filter 1 (Pack of 1)",
        "reviews": [
            {
                "review_posted_date": "26 Apr 2017",
                "review_author": "Ryan S.",
                "review_header": "Good product",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I have only installed this and had it one day but what can I say, it's a water filter. It does exactly what it is supposed to do. I'm pretty sure all the people complaining about the taste and The water being foggy don't follow directions. You have to flush a lot of water through first (4 gallons). The water only looks foggy because a filter is hundreds of thousand porous holes squeezing water through and that's how it's filtered. So for the first few days you are getting all those little bubbles from the porous holes. It goes away after a couple of days. Tastes good"
            },
            {
                "review_posted_date": "27 Jun 2017",
                "review_author": "Meticulous Mom Reviews",
                "review_header": "by far the best brand that we have found",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "by far the best brand that we have found. We love the fact that you can use your amazon prime & it gets here in a matter of days. Sometimes these will go on sale & we stock up because we have had really good results from this filter. It is true to time. Meaning, I have wrote the dates of the day we replace the filter on the filter itself and each one has lasted us exactly 6-6.5 months & we use it A LOT! it is our main source of water in the house because we are iffy about consuming the tap water! Great purchase. You can truly taste the difference it makes!"
            },
            {
                "review_posted_date": "01 Jun 2017",
                "review_author": "MS",
                "review_header": "Certified replacement for Filter 1 : W10295370A",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "The product was delivered as expected and is as per description. This is meant to replace the earlier model by Pur ( see photos attached). After replacing, during first one or two quarts there may be name sound as the water gets inside the filter, which seems normal and goes away immediately after. The instruction says to throw way first 4 gallons of water after replacing."
            },
            {
                "review_posted_date": "08 Jan 2017",
                "review_author": "Ashley",
                "review_header": "This filter only causes problems...",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "I have bought two of these filters and they only work for a few gallons and then they clog, they have also caused my ice maker to sputter and now I only inconsistently get ice, hopefully this will stop eventually. The people posting positive reviews must not have my fridge WRS325FDAM02. Stick with the old blue filters. I find it hilarious how much whirlpool is pushing these overpriced filters, when the old blue filters work fine. My next fridge will not be a whirlpool, I will be sure not to buy one that does not take drop filters. My father in law has also had difficulties since using the new white filters as well. His filter does not even stay locked in the fridge, it just keeps getting ejected from the filter holding mechanism."
            },
            {
                "review_posted_date": "22 Mar 2018",
                "review_author": "Sammie D.",
                "review_header": "Great replacement filter for Whirlpool fridge",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I was skeptical about buying the water filter after all the negative reviews, but it surprised me. My fridge was new and this is the first time I had to change the filter. Whatever filter was already IN the fridge had a terrible plastic taste so I was concerned that it would stay around with the new filter. To my big surprise it was much better. I only drink spring water and have drank from the filter and liked it- it had no after taste or plastic taste anymore. I did have some air bubbles following the filter change but it does go away after a little while. I made sure to run the water before the first use (as directed) although I didn't measure the water so was it exactly however many gallons??? No idea! I am very happy with my purchase and will only order this filter for my Whirpool fridge."
            },
            {
                "review_posted_date": "27 Sep 2017",
                "review_author": "Starman",
                "review_header": "Good item works on whirlpool, very good",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "This item works. I purchased a different product that was half the price for a two pack, but they did not work on my whirlpool side by side fridge/freezer. All these aftermarket products say they fit and work and have correct part numbers, but the in expensive ones do not work on my fridge. This one works. Costs more,but it's well worth it. Update: 6 months later, this filter is perfect, and it's been the only one that works on my whirlpool refrigerator. No problems, works grest"
            },
            {
                "review_posted_date": "09 Jan 2018",
                "review_author": "Chris C",
                "review_header": "The only one that worked for me",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "I went through about six different water filters from various brands trying to find one that would work for my four year old Kenmore refrigerator on my last refill. Up until that point I had been successful using 3rd party filters. This time there was a change in the design for the filters by all manufacturers. Each one would fit fine but I could not get any pressure at all, just a hammering sound. This official Whirlpool filter worked right away, producing better water flow than I have gotten with any of the other filter manufacturers. I didn't notice any difference in the taste of the water. The filter was troublesome after the first night and I had to adjust it a few more times before it was just right to keep the water flowing. No problems in the month since. I knocked one point off since it is a little pricey."
            },
            {
                "review_posted_date": "23 May 2017",
                "review_author": "Thrifty",
                "review_header": "50/50 you'll get the wrong filter.",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "I entered my serial number from my refrigerator as required to find the proper filter, it said this filter would work for my refrigerator, it was wrong, could not have been more wrong. They do make the filter for my Kitchenaid fridge, but they don't sell it here. Unless you can tell what you're ordering by the package photo, I would not rely on their set up for entering your serial number off your appliance or model number here."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "19%",
            "2 star": "7%",
            "5 star": "56%",
            "1 star": "6%",
            "3 star": "12%"
        },
        "url": "http://www.amazon.com/dp/B000USRG90",
        "price": "$9.06",
        "name": "Uvex Skyper Blue Light Blocking Computer Glasses with SCT-Orange Lens (S1933X)",
        "reviews": [
            {
                "review_posted_date": "16 Sep 2014",
                "review_author": "DF",
                "review_header": "Blocks the blue so your body naturally produces melatonin - just be careful with a few things",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "As an amateur astronomer, I've done a lot of research about light pollution. That led me to research about how light affects sleep. Here's the summed-up version so you don't need to read all those scientific papers I have: - Blue light is great for being awake - that's why you wake up with a blue sky (read about melanopsin and melatonin on Wikipedia) - Blue light is not good for sleep; in the 470 nanometers range, that suppresses melatonin (a key hormone for sleeping well) - Humans (and other animals) evolved to sleep in the dark - or, at the darkest, full Moonlight (just 0.1-0.3 lux of light) - Longer wavelengths of light were the only source of light at night for most of human history (fire / candles) - Tablets / phones / screens / LED's and many CFL bulbs have strong blue wavelengths that are messing with our circadian rhythms and suppressing melatonin, because they have wavelengths shorter than 530nm - 540nm So what to do in our modern world? Wear these glasses before bed. Natural melatonin production would have occurred with our ancestors starting with the onset of sunset. Wavelengths of light from the setting sun would have shifted to red, and fire or candles were usually the only form of light available. Those are both relatively dim, and in longer wavelengths. Today, our \"connected\" world has a LOT of blue light. It's messing with our sleep patterns, because our bodies evolved to only see red/orange/yellow light at night, NOT blue light/shorter wavelenghts. THESE GLASSES BLOCK THOSE MELATONIN SUPPRESSING WAVELENGTHS. Put them on a couple hours before bed. For me, I start getting drowsy about 90 minutes after wearing them. The trick is DO NOT take them off without closing your eyes or being in a dark room (a room with ONLY a dim red light would work too, as your melanopsin won't trigger melatonin suppression with red light). So when changing for bed, close your eyes when removing your shirt if you have to pull it off over your head or put your night time clothing on. Then leave these on until you turn out the light for sleep. And be sure to sleep in the dark too, or wear a sleep mask. Small amounts of light can still affect your melatonin (well, anything brighter then full Moonlight - yes, even a blue LED on your computer). You can watch TV with these on, check your phone, read your tablet, work on your laptop - just note that colors will look weird. Blue looks black. Yellow looks white. Greens look weird. And the glasses aren't exactly stylish. But if you sleep better, who cares? They work. And while you're at it, make sure your home's lights (and business if you own one) aren't shining into other people's homes or apartments. Too much light at night is what makes these things necessary in the first place. We don't need all this light at night; these glasses are just a band aid to help; what we really need is smarter outdoor lighting - aimed down, at the ground, at the proper color(s) so we aren't suppressing others melatonin. According to a Harvard study, the U.S. loses $63 BILLION dollars per year due to American's insomnia. Artificial light at night messing up people's sleep is undoubtedly part of that - let's fix that so these glasses aren't as necessary. Oh, and did these glasses work for me? An emphatic YES, they did. 5 nights (so far) of excellent sleep and well-rested mornings. And I am NOT a morning person! They work - just use them the right way, and be sure you're not doing other things that might hurt sleep (too much caffeine, lack of / too much exercise right before bed, sleep apnea, etc.) So if it's not a medical condition, do the right things, wear these, and get better sleep."
            },
            {
                "review_posted_date": "11 Aug 2015",
                "review_author": "Jeremy",
                "review_header": "Sleep Like Nature Intended",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I have been an electronics junkie all my life. Unfortunately, I have also been having terrible insomnia and light sleep problems for most of my life. These glasses have helped change that. The build quality is honest to the $9 price. I have a narrow face and these glasses fit me perfectly. They block out all the blue light ruining your natural \"come down.\" You will experience a more natural circadian rhythm while still indulging in the modern electronics. Installing \" Flux. \" and wearing these glasses are recommended for all computers and phones. They even work well as safety glasses while doing yard work due to the wrap around fit. Highly recommended for students, workaholics, computer junkies, late night TV addicts, and lab assistants. Try them yourself!"
            },
            {
                "review_posted_date": "17 Oct 2017",
                "review_author": "AE",
                "review_header": "Sleeping well and waking happy! My chronic sleep problems have been resolved!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I can sleep at last! These orange Uvex Skyper glasses worn every evening - in combination with the Luminette Bright Light Theraply Glasses worn every morning - have totally transformed my life! Prior to buying these two items my sleep cycle had been appallingly since uni days. Years of working on a laptop all night in a brightly lit office had ruined my body's ability to regulate its sleep. I'd be bursting with energy at midnight, and then still powering away at dawn. It was easy to stay awake for 36 hours at time, but almost impossible to sleep. Mornings were just awful, and I'd feel lacklustre all day ... until about 7pm when my energy levels would begin to rise again. Over the years I had often tried to reform my sleep, but without any success; clearly, my brain was simply not producing melatonin. A few months ago I decided to start an experiment to see if cutting out blue light at night, and then adding bright blue light in the mornings, could overcome the chronic sleep problems. The science seemed valid, so I hoped it would work on me. I bought both the Uvex Skyper orange glasses (to block blue light in the evenings) and the Luminette glasses (to simulate bright daylight in the mornings) and used both diligently every day as part of a program to reform my sleep. Here's what I experienced. 1. Within a couple of weeks of wearing the Uvex Skyper glasses I started getting sleepy at around 11pm, like normal people do!! 2. After just a few mornings of wearing the Luminette glasses I began to enjoy waking up. I couldn't wait to pop on my \"happy glasses\" as they made me feel wonderful! Now, more than 2 months later, I wake every morning around 7am feeling bright and cheerful. 3. The quality of my sleep has been completely transformed. Only three months ago I would wake every half hour and then lie awake for another two or three hours; now I sleep soundly the whole night through! Based upon my experience, here are the key conclusions I'd to share with others. * If an inability to wind down or fall asleep is your main problem, then the orange Uvex Skyper glasses (around $9) should be your first purchase - because if you can kick-start your melatonin production at night, then you will sleep better and wake happier. * However, if you struggle to wake up and you feel sluggish for hours afterwards, then the Luminette glasses could be transformational for you (as they were for me). I used to hate mornings ... and now I love them! * You still need to be sufficiently self disciplined to use the specs diligently. E.g. if I forget to wear the orange glasses for a few nights, then my old habit of staying awake all night quickly returns. I'm writing this review jointly for the Uvex Skyper Blue Light Blocking Glasses (for evenings) and the Luminette 2 SAD Bright Light Therapy Glasses (for mornings) because I used both over the same time period and it isn't really possible to tell which of them has contributed most to resolving my sleep and wake problems."
            },
            {
                "review_posted_date": "14 Oct 2015",
                "review_author": "Cf777",
                "review_header": "Well I am super skeptical when it comes to things like this",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Well I am super skeptical when it comes to things like this ...how can glasses help you sleep better you know ? My boyfriend has a pair of these and swears by them so I finally bought some. I have severe insomnia so what did I have to loose right. I got the glasses put them on and within the first hour I noticed I was getting tired and it was only 9 pm usually I don't even start to get tired until 2-4 am so this what weird to me it's not been about a week and man do these things work it's almost conpletely fixed my insomnia now I get tired around 8 -10 so I would highly reccomend these ...they are kinda big and goody looking but worth it"
            }
        ]
    },
    {
        "ratings": {
            "4 star": "15%",
            "2 star": "2%",
            "5 star": "76%",
            "1 star": "2%",
            "3 star": "5%"
        },
        "url": "http://www.amazon.com/dp/B00006IAKF",
        "price": "$10.99",
        "name": "Rolodex Deep Desk Drawer Organizer, Metal Mesh, Black (22131)",
        "reviews": [
            {
                "review_posted_date": "23 Aug 2015",
                "review_author": "dchego",
                "review_header": "Make-up Caddy",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Love it - I wanted a make-up organizer and they were soooo expensive so I scanned through the office organizer and found just the right size - for a fraction of the cost!"
            },
            {
                "review_posted_date": "15 Oct 2015",
                "review_author": "Kate",
                "review_header": "FAST Shipping, Great product",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "WOW! Amazingly fast 1-day delivery! Also packaged with typical Amazon standards (big box plus lots of air pillows means you product will not be damaged during shipping). This item is Rolodex brand, a better quality (thicker metal) than many other black mesh office organizers on the market. It is a lot bigger than I expected, but that is my fault for not getting out a tape measure and looking at the dimensions closely or noticing the description \"Deep Drawer Organizer.\" It seems to be measured at 15\" x 12\" x 1-7/8\"H. It's actually too big for my desk drawer but I have re-purposed it into a spice rack that sits nicely on the kitchen counter! =)"
            },
            {
                "review_posted_date": "03 Jan 2016",
                "review_author": "Amazon Customer",
                "review_header": "Good multipurpose item",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I bought this business card holder to serve as a cell phone stand for my iPhone 6 Plus when I am at the office, and it works perfect! My iPhone stands up both vertically and horizontally, and provides a place for my phone when I get back to my desk so I can have my news feed, stock feed, or whatever I want on that extra screen space. It is also so cheap as an Add-on item as well, how can anyone complain? The quality is just as nice or nicer than most business card holders I see within public office spaces. The black metal mesh is much nicer than other plastic options. This really is a good item, and I am sure others will find other uses for this as I have; as it is very sturdy, lightweight, and cheap. When I decide not to use it as a cell phone stand, I will repurpose it as a normal business card holder. I liked this product so much, I bought a second one for my house; and it has become a \"chair\" for my iPhone whenever I am doing dishes or just doing daily chores. Helps with organization so I always know where my phone is if I set it down."
            },
            {
                "review_posted_date": "05 Oct 2015",
                "review_author": "Courtney Toombs",
                "review_header": "I like this design for many reasons",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I work for a hotel and I purchased this to use there. The drawer organizer that we had previously was relatively small, I decided to purchase this one due to the dimensions of the small, square spaces. I was looking for something that would hold our room key cards and envelopes well and it looks as though I have found it! I like this design for many reasons, firstly with the mesh design it will be much easier to clean out compared to more solid materials. Working in a space where several other people work, there is bound to be bits of dust and dirt getting into things, with this it'll be much easier to keep it clean. Also, with the size of the two larger compartments, there is ample space for everything that we keep in the drawer. Not only can we fit all of our writing utensils into one compartment, we can keep larger things such as our scissors in the other, which is something we couldn't do with our smaller organizer. As I mentioned previously, I was looking for an organizer that would hold our key cards and envelopes. The four smaller compartments are perfect, I like that this comes with a little insert for one of the smaller compartments because it's great for holding paper clips. Overall, this is a wonderful drawer organizer, it's a tid bit larger than I was expecting, but it is absolutely perfect for what I was needing it for."
            },
            {
                "review_posted_date": "10 Dec 2014",
                "review_author": "Barbara K",
                "review_header": "I Can Find Everything in my Desk Drawer with This!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Exactly what I needed to be able to find things in my desk drawer! I am not the neatest person and whenever I looked for anything in my desk drawer, I'd have to shuffle through the mess to find it. That's changed now and at least one area of my life is organized! IMPORTANT: It seems several reviewers complained it didn't fit in their drawer. The first thing to do is MEASURE before placing the order! Seems obvious! Mine fits perfectly! As you can see from my photo, I have a place for everything with four small compartments in front and two large ones in back. I keep my keys in there now so they don't get lost! Also postage stamps and return address labels, business cards, paper clips, checkbooks, spare batteries, lip balms, nail files, calculator, pens, you name it!"
            },
            {
                "review_posted_date": "17 Jul 2015",
                "review_author": "Elizabeth",
                "review_header": "Sturdy and Useful",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I bought this to use in my dorm, and though I haven't moved in yet, I did take a look at it and mess with it a bit. Comprehensive review ahead, skip to the end if you just want my overall opinion ~ Packaging - It was delivered with another item, and it was loose with the drawer attached with plastic along with a tag. It was padded with big plastic bubbles, and there was no damage from shipment. As a cool bonus I got this the day after I ordered it even though I had 2-day shipping. Quality - The metal mesh is sturdy and feels like it will hold up over time and use. One note - the drawer is very loose and will fall out if you pick up the organizer and tilt it forward at all, so be careful if you're moving it full of supplies. Usefulness - The compartments are big enough to fit several pencils and pens on the sides, and on the top they are shallow and suitable for things like erasers and replacement staples. The drawer is roomy and will fit lots of sticky notes, but will not fit standard 3x5 index cards. Overall, this should fit the average student's needs. My opinion- I wish the drawer was big enough to fit index cards, but overall this seems like a sturdy and useful product, well worth the money."
            },
            {
                "review_posted_date": "24 Oct 2015",
                "review_author": "Penny",
                "review_header": "... would hold about 5 packs of post its is pretty big perfect for a lotlke note center or odds ...",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "As you can see in my photos this hold so many desk items so handy to organize it has 4 compartments for pens and scissors it has a rectsnslit I keep glue stick and white out in and 2 squares on top for paper clips etc and s drawer that is deep enough for 2 scotch tape and I keep a little pack of post it's on there it would hold about 5 packs of post its is pretty big perfect for a lotlke note center or odds and ends would recommend it love mine it is solid in bottom not mesh so that if a pen or market meal they won't mar desk top they thought it out well! I have throw out 10 of these through the years"
            },
            {
                "review_posted_date": "13 Jan 2015",
                "review_author": "Gutatto",
                "review_header": "Works just as you hoped it would",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "just heavy enough, durable, and small. This organizer is quite useful if you have a tendency to lose things. The organizer looks even nicer in real life. The only caveat is that the bare metal will be touching the table, which could scratch the surface if you're not careful."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "15%",
            "2 star": "4%",
            "5 star": "61%",
            "1 star": "13%",
            "3 star": "7%"
        },
        "url": "http://www.amazon.com/dp/B009NVTE5E",
        "price": "$20.00",
        "name": "DYMO LabelManager 280 Rechargeable Hand-Held Label Maker (1815990)",
        "reviews": [
            {
                "review_posted_date": "23 Mar 2012",
                "review_author": "Nathan Kull",
                "review_header": "Nice handheld label printer with QWERTY keyboard.",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "Most of the handheld label printers are built using ABC keybaords vs. the QWERTY keyboard, and that was a key factor in my decision to buy this scanner. Some people have claimed that using DYMO label makers vs. Brother label makers will save money as the DYMO does waste less label when printing, this is both true and false --- I will explain more further down in this review. I would like to add to this review a comment about batteries, there has been multiple comments about this label maker \"eating batteries\"; I have used up trial cartridge and many labels into my second cartridge and have not changed the batteries in this unit. I am using Eneloop Rechargeable batteries and they have performed flawlessly. Keep in mind that this would be a higher drain type of device when printing and cheap \"Super Duty\" (Non-alkaline or cheap Rechargeable) batteries are probably not going to work well. As always, I recommend the investment in Eneloop batteries with a good charger (LaCrosse BC-700) PROs: - Handheld form factor - Easy to use - Prints nice looking labels - QWERTY Keyboard CONs: - NO access to any special charactors except via menus (i.e. if you need a \"-\" or a \".\" on your label, there is NO button for this and you have to go into the symbol menu to find the symbol you want) ... This is annoying and is the reason that this label maker looses one star (most of my labels include \"-\" or \".\" in them) **************************************************************************************** *** The truth about actual label costs (Pictures will be attached to this review) *** **************************************************************************************** I printed out labels using a Brother P-Touch PT-2030 and the DYMO LabelManager 160 and these were the results of my findings: As of the time of this writing, the DYMO 1/2\" D-1 label roll is selling for $14 and includes 23 feet (276 inches) of label As of the time of this writing, the Brother 1/2\" P-Touch label roll is selling for $11 and includes 26.2 feet (314 inches) of label I printed two labels that had this text in 24pt BOLD \"TEST-XX-01\" The DYMO label that was printed including wasted space on both sides was 2.75\" in length which would allow 100 labels to be printed on a $14 roll *** $0.14 per label The Brother label that was printed including wasted space on both sides was 4\" in length which would allow 78 labels to be printed on the $11 roll *** $0.14 per label *** TIE *** I printed two labels that had this text in 24pt BOLD \"255.255.255.255\" The DYMO label that was printed including wasted space on both sides was 3.375\" (3 3/8\") in length which would allow 81 labels on $14 roll *** $0.17 per label The Brother label that was printed including wasted space on both sides was 4.5\" in length which would allow 69 labels on a $11 roll *** $0.16 per label *** BROTHER WINS *** The DYMO would win with smaller labels, it seems that my first label tested is about the tie breaker in size. Bottom line: If you print SMALL labels, you will get more for your money using a DYMO label printer with less waste per label If you print larger labels, you will get more for your money using a BROTHER label printer even though it waste more per label The DYMO generally prints more labels per roll than the brother, even though there is less label per cart, however the Brother label is cheaper at this time. There is also the consideration that you might be ok with the extra tape used by the dymo, and that you might hate how much extra tape is used with the brother, ... How much time might you spend trimming brother labels because they are huge? They are both great label makers ... I hope this review helps someone make an informed decision!"
            },
            {
                "review_posted_date": "09 Apr 2016",
                "review_author": "Ted Larsen Jr",
                "review_header": "I promise!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Wow really? People complain about the symbols? I've used a ton of label makers and this on is far and above passes them all! OK so the symbols are on a separate button bug deal.. It's the perfect size It prints super clear It has a button for clip art designs and pictures! It can write multiple lines on a single strip! It has borders you can select to put around the text! It can write horizontal and vertical! The font sizes go from 8-20 on 1/2 inch tape with selection of 2 in between! The price is 9 dollars! And it comes with tape! Don't listen to these people complaining of things like \"it's such a pain to need symbols\" blah blah blah. Just grab this and a 2 pack of 23 foot long rolls and you'll love the thing! I promise! Oh and did I mention it's super quiet! The tape cutter is very smooth and comes out from the top instead of the sides like other label makers! And after all that... If you turn it over you can physically see how. Much tape you have left. Kind of like a gas gague, there is a little Window. Just buy the thing quick!"
            },
            {
                "review_posted_date": "24 Nov 2015",
                "review_author": "Brittney Williams",
                "review_header": "It's great I guess.",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I love labeling things and was so happy to receive this label maker. Within a day I was severely disappointed though, when I attempted to label Oliver and it wouldn't adhere. I guess I'll give it five stars though. Whatever."
            },
            {
                "review_posted_date": "08 Jun 2016",
                "review_author": "Taylor",
                "review_header": "The Labeling Master!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I just needed something simple that did 2 lines and had a descent amount of clip art. It does the job, and as an added bonus, it's actually easy to peel the backing off. It splits into 2 pieces. On my last labeler, you had to work that finger nail between the backing and the tape to remove it. That required some time and patience. IT professionals don't have that kind of time. Thanks DYMO for making things easy and quick! The labeler is fun to use and comes with a rechargeable battery. It's nice to be able to keep the battery inside and recharge with a charger. No more digging out 6 \"AA\" batteries like in my old single line labeler. Thanks!"
            },
            {
                "review_posted_date": "25 Jul 2014",
                "review_author": "J. Henry",
                "review_header": "More fun than you'd think a labeler can be.",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I had an older Dymo labeler that used a specific cartridge. I bought a replacement cartridge to find that my labeler had stopped working. This is the only new Dymo labeler I could find that used that same cartridge, so I bought it and it's actually pretty cool! First of all it's quite portable and has a rechargeable battery. Second, it comes with a USB cable so you can attach it to your computer, download some free software and it becomes a real printer! No, you're not going to print out a letter to grandma, but you can create your label on your computer screen (which is easier than typing it directly into the labeler) and the coolest thing (at least with my MacBook Air) I can print a label out using any font that's on my computer!! You're not limited to the few that are native to the labeler. Want a label printed out in Ariel, Helvetica, Courier, Papyrus, Brush Script? You can do it! And you print right from the computer! Very cool! I've been putting labels on everything!"
            }
        ]
    },
    {
        "ratings": {
            "4 star": "11%",
            "2 star": "1%",
            "5 star": "81%",
            "1 star": "2%",
            "3 star": "5%"
        },
        "url": "http://www.amazon.com/dp/1582972400",
        "price": "",
        "name": "The Crystal Bible",
        "reviews": [
            {
                "review_posted_date": "08 Jul 2015",
                "review_author": "Ami",
                "review_header": "Great series.",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "The three-part Bible series is great. Keep in mind none of the stones are duplicated from one book to another, so buying #3 does NOT mean you get everything in 1 and 2. You \"need\" all three, which gives you upwards of 750-800 stone descriptions in total."
            },
            {
                "review_posted_date": "12 Nov 2016",
                "review_author": "Neysha",
                "review_header": "This review is for the kindle edition only. The ...",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "This review is for the kindle edition only. The kindle edition does not have pictures which makes it hard to identify stones."
            },
            {
                "review_posted_date": "22 Dec 2016",
                "review_author": "CM",
                "review_header": "No pictures!",
                "review_comment_count": "",
                "review_rating": "2.0 ",
                "review_text": "I wish I had realized that there is one other review here for the Kindle version and it clearly states there are no pictures. If I had realized that I probably wouldn't have purchased this at all. It will be useful for looking up attributes of different stones/crystals but that's it. I'll have to go elsewhere for any help identifying stones."
            },
            {
                "review_posted_date": "12 Aug 2017",
                "review_author": "Kindle Customer",
                "review_header": "This really truly is awesome!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I have worked with crystals for 25 years and it's been a long process to get better at using them. At first nothing would happen at all.This book goes into so much detail the stone, the colors, the shape, all sorts of stuff. I am so glad I bought it. I think she wrote another book but this one is really important. It goes through the physical & emotional & spiritual impacts of the crystal on the body as well as a ton of other information. If you are looking for a book truly this is it."
            },
            {
                "review_posted_date": "18 Aug 2017",
                "review_author": "Salmz",
                "review_header": "I am just venturing into the realm of energy and ...",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I am just venturing into the realm of energy and crystals. This book was is very informative. I was able to find every crystal I purchased in the book. It provides information on the color, appearance, rarity, and source of each crystal. Then there is information about the attribute - including color variations, healing, and if there are special considerations in caring for the crystals, it's listed as well. I look forward to using this book for referencing all the crystals that I currently own, and looking into what other crystals would be beneficial for me."
            },
            {
                "review_posted_date": "08 May 2017",
                "review_author": "Phoenix",
                "review_header": "Beautiful Pictures",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I just bought the ebook, and I'm not sure if this book has been revised, or not, but I am going to have to disagree with some of the other reviewers. THIS EBOOK HAS BEAUTIFUL, CLEAR PICTURES OF EACH CRYSTAL DESCRIBED. It contains quite a bit of useful information, and it is perfect for someone who is curious about the metaphysical properties of various crystals and wishes to be able to identify them."
            },
            {
                "review_posted_date": "24 Mar 2017",
                "review_author": "ReneeLouise",
                "review_header": "Smaller than expected.",
                "review_comment_count": "",
                "review_rating": "3.0 ",
                "review_text": "Its a wonderful source for stones. However, I didn't expect the book to be so small though. Its only 6 1/2 by 5 1/2. Its thick with very small print. Put on you specks to read this! I tried and found it difficult anyway. This is not a crystal bible because petrified wood nor pyrite was not listed yet amber was. The only 2 stones I wanted to read about was not even in listed in this book! I was so disappointed that I just gave this book away this morning."
            },
            {
                "review_posted_date": "16 Aug 2015",
                "review_author": "Harry",
                "review_header": "A great crystal encyclopedia BUY IT!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "This book is great! BUY IT. I have seen this book in every metaphysical shop I've been to and every time I passed on purchasing it, because I figured that I can just look up what I need online for free. While that is true, this book is worth having because it provides all of the information in a consistent and enjoyable format all in one place, much like an encyclopedia. Each stone is easy to look up and it gives you all of the information you would want to know about it: color pictures, defined color of stone(s), appearance, rarity, source, general physical and metaphysical attributes, healing purposes, position on body. You won't have to supplement this information with any other reference material or the Internet. Additionally, the book provides several other chapters regarding all of the general knowledge surrounding crystals and crystal healing that you would want (pictured below \"Contents\"). I use the book all of the time with my stones."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "11%",
            "2 star": "4%",
            "5 star": "76%",
            "1 star": "5%",
            "3 star": "4%"
        },
        "url": "http://www.amazon.com/dp/B009P4845K",
        "price": "$41.22",
        "name": "Cuisinart MCP193-18N MultiClad Pro Stainless Steel 3-Quart Saucepan with Cover",
        "reviews": [
            {
                "review_posted_date": "08 Sep 2015",
                "review_author": "Ang",
                "review_header": "Great Cookware!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I've had a set of this cookware for 3 years now and use it every day. The best as far as I'm concerned. Some have complained about how it looks after being used and oxidation occurring saying it's \"flaking\". Stainless Steel is a metal not a coating. I just can't see how it can \"flake\" off. In the research I did on stainless cookware before I chose these I found that it's a common/normal thing that happens with this type cookware. Bar Keepers Friends does a fantastic job of restoring these to like new condition. I use mine every day and I've never done anything to be extra careful while doing so. I got them to cook for my family and that's what I do. These spots don't hinder the function of these at all, it's merely cosmetic. However, having said that if you want your pans to always look brand new and unused and don't want to use a \"toxic\" cleaner I suggest you do what I just did and use plain old household vinegar for the same results. If I can figure out how I will post a photo of before and after a couple minutes of vinegar. I just added a very small amount of vinegar, about 2 T probably, swished it around let it sit for a minute, applied a sponge, rinsed, dried and bam see next photo. Like new shiny. Yes it probably has a few scratches but that too is normal after 3 years of use I'd imagine."
            },
            {
                "review_posted_date": "09 Feb 2015",
                "review_author": "Bradley",
                "review_header": "Narrowed it down to this and a few others? THIS IS THE ONE.",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "We bought this to broaden our culinary horizons. After my usual weeks of constantly reading into reviews and Youtubing, I decided this HAD to be what I had been searching for. The Cuisinart multiclad pro 12 piece set has turned me into the man of the kitchen I've always wanted to be. The days of \"toss whatever frozen meal bag in a non stick pan and let's eat\" are over for me. The first night we used them on come chicken breast, steamed some carrots, and made a brown sugar glaze for them. The even browning of the multiclad technology was incredible. This set makes me feel like I CAN make more than just something to eat, were actually making delicious meals and it created a \"drive\" to cook better because we know we are capable now! I can now see that stainless steel really does cook food better than non stick. The one thing I really thought would kill me is the pain of cleanup every night. We use this for all of the food we cook daily and as you fellow avid reviewers may have read, Bar Keepers Friend really what you've heard! I've used this skillet daily for a few weeks now and hot water, BKF, and a little scrubbing and they clean up great and HONESTLY quite easily. We've cooked everything with coconut oil and that stuff really makes a great oil. No sticky burnt food, just lightly stuck browned bits that can make a great pan sauce! Which is a great first step to cleaning! Using what you got! I honestly love this set and it deserves every 4-5 star review its got. You'll love this set."
            },
            {
                "review_posted_date": "16 Jan 2013",
                "review_author": "SMDEE",
                "review_header": "Great Value",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I was looking for a set of stainless sauce pans to replace my very aged Magnalite aluminum set which has pitted badly. I wanted fully clad stainless cookware. I looked at All-Clad Stainless, Cuisinart Multiclad Pro, Calphalon Triply, and the Tramontina Triply. I wanted a rolled lip to make pouring easier so that eliminated the All-Clad and Tramontina entries. Not sure which of the remaining two I wanted, I bought one each of the Cuisinart Multiclad Pro and the Calphalon Triply Stainless to test. After using each about a half dozen times, I was pleased with the performance of both. Neither seems to have any significant performance advantage over the other. Both heated evenly, were solidly built, and were comfortable to lift and pour. Neither handle heated too much during cooking even after simmering tomato sauce for hours. The Cuisinart's handle was warmer than the Calphalon but not by much. I did find the Calphalon slightly easier to clean food that had become stuck to the surface. However, that was negated by having a third handle rivet to clean around. Essentially, performance was the same from both lines. For those that are concerned with the appearance of the cookware, the Cuisinart Multiclad line has a brushed finish. The Calphalon Triply are polished to a mirror finish. Both were fine with me as I don't much worry about how they look. I chose the Cuisinart sauce pans for a few reasons: lids, pan sizes, and price. I like the Cuisinart's metal lids more than the Calphalon's glass ones. I don't understand the benefit of glass lids. They can't take the higher heats that metal can, can break if dropped or banged, and fog up when used so you can't see what's in the pot, anyway. The sauce pans in the Cuisinart line are available in 1.5, 2, 3, and 4 quart sizes. That's perfect for my needs. The Calphalon was availabe in 1, 1.5, 2.5, and 4.5 quart sizes. I really wanted something in the 3-3.5 quart range since I use it frequently but it is not available from Calphalon. They do make a 3 quart Chef's pan but I didn't want the curved bottom. The Cuisinart Multiclad sauce pans are priced approximately 50% less than the Calphalon Triply pans. Since they performed evenly well, the Cuisinart Multiclad Pro seemed to fit my needs best."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "16%",
            "2 star": "8%",
            "5 star": "49%",
            "1 star": "16%",
            "3 star": "11%"
        },
        "url": "http://www.amazon.com/dp/B01CT3K500",
        "price": "$37.27",
        "name": "Viviscal Extra Strength Hair Nutrient Tablets, 90-Tablets",
        "reviews": [
            {
                "review_posted_date": "18 Dec 2017",
                "review_author": "S Matthews",
                "review_header": "I Like Viviscal",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "I have been using Viviscal for a little over a month now, and it is a nice natural product, it is basically a vitamin for your hair. I use it together with Minoxigaine Minoxigaine by Hairgenics FDA Approved Hair Growth Formula with 5% Minoxidil Plus Powerful DHT Blockers which is a combination of rogaine's minoxidil with other hair growth ingredients that really work, I definitely notice less shedding and some new hair growth."
            },
            {
                "review_posted_date": "30 Jul 2017",
                "review_author": "Amazon Customer",
                "review_header": "NOT THE SAME ITEM SOLD BY OTHER OFFICIAL VIVISCAL RETAILERS. RIP OFF.",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "I do not believe the item being sold here is the authentic Viviscal Extra Strength Pill. I read the reviews before purchasing, which questioned the authenticity of this product, but chose to ignore it since the vendor was viviscal. BIG MISTAKE. While packaging may change, and the items with older packaging are commonly reduced in price; i do not believe this is the same product as what is sold from other vivscal retailers. First, after taking this product for 3.5 weeks, I saw no change in hair loss. Second, after taking this product for 3.5 weeks I developed a horribly dry/rashy scalp. It was unbearably dry, flaky, and itchy. I decided to stop taking viviscal. My scalp eventually recovered. believing this product not to be the real deal, I purchased it at Target for $35.00. The packing is almost exactly the same but as mentioned in a previous review, the lot numbers are different. Amazon viviscal is alpha numerical, and targets in just numerical. The pill packaging is different which could fall under the packaging my vary description. The biggest and most disturbing difference is in the pill itself. The pills from target which is a verified Viviscal retailer, are denser, a totally different color and have a grainier look to it. This made me wonder what did I buy from Amazon? The pills look and smell different despite the Supplement Facts being EXACTLY the same. I have no idea what I was ingesting believing it to be Viviscal, and I would strongly recommend that NO ONE buys this from Amazon. Target might be a little bit more but it is worth it for an authentic product that does not potentially give you an awful reaction!"
            },
            {
                "review_posted_date": "19 Dec 2016",
                "review_author": "L_H",
                "review_header": "Suspicious of Product Authenticity",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "I've been using this on and off for a few years. I noticed in the last year it was not working as well, my hair was not growing as fast. I read other reviews stating it wasn't the same product as sold by the company or say another distributor like Walgreens or CVS. I went to Walgreens to purchase and sure enough the pills look, taste, and smell differently. I saw more results in less than one month of taking the pills from the store than I did in 3 months with the ones from Amazon."
            },
            {
                "review_posted_date": "14 Dec 2016",
                "review_author": "William Brennan",
                "review_header": "FAKE REVIEWS on this page; product doesn't work",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "Amazon.com has allowed false reviews to flourish on this product page. I have called their attention to one that uses MY IMAGE without authorization (username: Kate, who has also posted a number of other seemingly false reviews on numerous unrelated products), and Amazon has refused to take it down. The reviews you are reading for this product are largely FAKE, as are many others on Amazon.com, most likely. I have used this product and found it to be lacking."
            },
            {
                "review_posted_date": "28 Mar 2016",
                "review_author": "Renee",
                "review_header": "Ireland-made pills are better if you can secure them. Watch out for breakouts!",
                "review_comment_count": "",
                "review_rating": "3.0 ",
                "review_text": "It's been about 20 days and I've only been taking one a day (at night) because the tablets were causing my skin to break out a lot. I'm not sure if I've noticed a difference but a good friend said my hair texture was less frizzy. My nails are super strong and long, however. I am confident that I'll see improvement in my hair with continued use. Update: The pills in first batch I ordered were wide and flat and made in Ireland (supposedly). I definitely have noticed a difference in my hair quality since I've been taking them. Just ordered my second box and the packaging looks like a knockoff, as well as the pills being smaller in diameter and thicker and made in the US (supposedly). I emailed Viviscal the lot numbers and expiration dates so hopefully they can confirm which batch is real. I will be returning these pills pending their response. There is a reason the price is significantly cheaper than the pills at the store. (First order is the box/pills on the right and the lot number on the bottom; second order is left/top. I think the second one is the fake.) Update #2: I checked the lot numbers and expiration dates with the company and they told me that both boxes were legit but they have two factories, which would account for the differences in the pills. However, the second box (made in the US) is giving me really bad, unrelenting acne. The first box from Ireland also caused breakouts but that subsided after a week or so whereas this time it won't stop. If I can consistently get the pills made in Ireland, I'll keep taking them cause they definitely do seem to be making some difference. If not, the acne is a dealbreaker."
            },
            {
                "review_posted_date": "14 Sep 2017",
                "review_author": "Amazon Customer",
                "review_header": "Pills turned Black",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "Please do not buy, these are fake, only God knows what they actually put in these pills for human consumption, pills began turning black after a few days of opening. Also when compared to another pack I bought from a store, these had no batch code and other stuff were very different from the original."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "11%",
            "2 star": "10%",
            "5 star": "71%",
            "1 star": "5%",
            "3 star": "3%"
        },
        "url": "http://www.amazon.com/dp/B019DHBCWK",
        "price": "$6.99",
        "name": "Fake Dog Lucy Poop Doggie Poo Realistic Doggy Doo Doo Dirt Joke Gag Crap Pile",
        "reviews": [
            {
                "review_posted_date": "14 Dec 2017",
                "review_author": "Etowahman",
                "review_header": "64 and still into crap? Yeah - guy thing",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "64 and still into crap? Yeah - guy thing. I specifically got it to get my neighbor, who's dog occasionally leaves a deposit in my garden area. Set this out by my door step and called him over when he got home. Acted upset - he apologized all over and was coming to scoop it up - until I picked it up. Got him good."
            },
            {
                "review_posted_date": "02 Mar 2017",
                "review_author": "Becca14",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Great form of entertainment. Looks real if so eine us panicking but it's quickly realized that it's fake."
            },
            {
                "review_posted_date": "25 Apr 2017",
                "review_author": "Picky1",
                "review_header": "Four Stars",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "Kids played a practical joke on the house cleaner for April Fools. Worked perfectly."
            },
            {
                "review_posted_date": "07 Jun 2017",
                "review_author": "Kindle Customer",
                "review_header": "Realistic",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "This is legit. We used it to prank a friend and it's disgusting real looking. It glistened in the sun like it was a sweaty poo sitting outdoors all day. Perfect"
            },
            {
                "review_posted_date": "24 Dec 2017",
                "review_author": "EMCW",
                "review_header": "Fabulous Fake!!!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Even though it same in a plastic bag, and I knew it was fake, I was still hesitant to touch it! Definitely looks like the real thing - its going in my husbands stocking as a gag gift - it looks 110% real!!!"
            },
            {
                "review_posted_date": "21 Feb 2018",
                "review_author": "Manslayer",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Awesome poop looks real. I am going to use it as a key hider in my yard."
            },
            {
                "review_posted_date": "24 Mar 2017",
                "review_author": "sagem39",
                "review_header": "Nice poo",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "It's the fake poop I always yearned for."
            },
            {
                "review_posted_date": "02 Apr 2017",
                "review_author": "pnk",
                "review_header": "SO REAL looking that my husband tricked me even thought ...",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "SO REAL looking that my husband tricked me even thought I had bought it for our 5 year old and 2.5 year old"
            }
        ]
    },
    {
        "ratings": {
            "4 star": "9%",
            "2 star": "2%",
            "5 star": "80%",
            "1 star": "6%",
            "3 star": "3%"
        },
        "url": "http://www.amazon.com/dp/B00PG6ZCT2",
        "price": "\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t",
        "name": "Mega Man amiibo (Super Smash Bros Series)",
        "reviews": [
            {
                "review_posted_date": "04 Oct 2017",
                "review_author": "D. Meeks",
                "review_header": "It was worth the wait",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "This thing is so good I’d wait 30 more years for the 60th anniversary edition. I didn’t open mine so I’m not sure the games it works with, just added it to my collection. It looks great though. My son gets confused over why we can’t open it, I told him he could have it when I died and that started a whole other mess that ended up with him getting his own. A must have. Order two if you plan on telling your kids you’ll die one day."
            },
            {
                "review_posted_date": "06 Apr 2017",
                "review_author": "MarineSgt",
                "review_header": "One Star",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "Watch out with the scammers anything lethal says just launch it's a scam -_-"
            },
            {
                "review_posted_date": "05 Apr 2018",
                "review_author": "Toad626",
                "review_header": "LOZ amiibos and Breath of the Wild Functions.",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Legend of Zelda amiibos are getting expensive I mean REALLY expensive. So you need to ask yourself do you really want it on your shelf and the Breath of the Wild Functions each provides? I want to help you answer that. Main in game functions I will mention is Legend of Zelda Breath of the Wild. (Though keep in mind some work with Smash, Twilight Princess HD, and Hyrule Warriors.) They will be organized into groups by their main drop. *Sword Group* - Travelors sword - Royal Sword and elemental arrows. (Smash Link/TP Link) The 2 work the same. Unique set: Twilight Princess skins. Epona appears on 1st scan. She's a contender for best horse. She sprints for more strides and the gentle temperament won't throw you off. Extras:Produce,Elemental arrows, shields Smash Link is a poor quality figurine while TP Link is one of the highest. (Skyward Sword Link) Unique: Skward Sword skins Goddess Sword. Forgettable Extras: rupees,shields High quality figurine (Breath of the Wild Link Rider) Unique: special horse saddle Extras:Produce High detail figurine. (8-bit Link) Unique:Legend of Zelda skins Sword. Nothing to go out of your way to aquire. Extras: Rupees,shields For the nostaligia collector. (Smash Toon Link/LOZ 30 anniversary Toon Link) Unique: Windwaker skins Seabreeze boomerang. I personally use boomerangs as melee weapons in Breath. The jury's out on this one. Extras:Fish Figures are good quality. *Bow Group* Travelors bow-royal bow (Smash Princess Zelda) Unique: Twilight Bow. This one rocks. Best bow by range. Literal sniper. Uses light arrows not your arrow supply. Has around a hundred shots before it goes. Not the most powerful but that range is second to none. Extras:gems, flowers, herbs Good quality figurine. Dress well done (Breath of the Wild Archer Link) Unique: none. May drop Falcon Bow but that's not exclusive Extras: elemental arrors, meat, fish Very High quality figurine. *Shield Group* Travelors shield-royal shield (Too Zelda) Unique: Heros Shield. Rendered useless by Hylian Shield. Extras: herbs, flowers, gems Figurine is ok it's good for what it is depicting (Breath of the Wild Zelda) Unique: none, source for radiant shield. Rendered pointless by Hylian Shield. Extras:herbs, flowers, gems Good figurine hard to find. *2 Handed Sword Group* Travelors claymore- Royal claymore (OoT Link) Unique: OoT skins, Biggoron sword. Not worth the trouble to get. Extras: meat, elemental arrows Figurine based on OoT artwork ok not great eyes look weird. (Smash Ganondorf) Unique: Sword of the Six Sages. Not worth it to go out of your way. Extras: rupees, gems, rare monster parts (unique to this Amiibo but you can farm all monster parts in game) Great quality figurine. Only Ganon we have so far for collectors. One of the more affordable amiibos. (Majora's Mask Link) Unique: Fierce Deity skins and sword. Functions the same as the in game barbarian set. Looks cooler but like barbarian set requires lyanel farming to upgrade. Extras: produce, elemental arrows High quality figurine. This one is expensive and getting worse...High demand by Zelda collectors. *Unique* they are all different. (Breath of the Wild Guardian) Unique: Source of guardian - guardian ++ equipment weapons and shields. Source of ancient and giant ancient (rare) cores. Source of ancient arrows. Source of ancient parts. This is the best Amiibo for in game use. If you only get one this is the one to get. Extras: gems Highest quality figure. Top 5 of best Amiibo design. Looks great. Expensive and getting worse. Approaching $50... (Breath of the Wild Bokoblin) Unique:none. In game use for this guy is at zero. Boko weapons are everywhere in game as is meat. If I had him I wouldn't bother to scan him. High quality figurine. Fairly rare in stores. (Smash Sheik) Unique: sheik's mask. Essentially an additional head skin working in the stealth clothes set. Source of Sheika weapons (outclassed by midgame) and elemental arrows. Extras: mushrooms *Champions Ballad set* All 4 may drop diamonds. Each has a unique helmet that pairs with the ancient armor set and each weapon drops corresponds to their race. Figures are of the highest quality. They are still in stores but buy fast. Happy Hunting."
            },
            {
                "review_posted_date": "05 May 2017",
                "review_author": "Madeline H B",
                "review_header": "One Star",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "Terrible, fake, do not purchase"
            },
            {
                "review_posted_date": "14 Feb 2018",
                "review_author": "Andrew",
                "review_header": "The King Dedede amiibo i ordered was described as the ...",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "The King Dedede amiibo i ordered was described as the USA version, but in fact it is the UK version of the amiibo. The UK version has the series the amiibo is from on the left, with the number and name of the amiibo in the top right; the USA version has just the name of the amiibo on the left and only the age restriction on the top right. Very frustrating to someone who is trying to collect the set from a specific region and the ad description is falsely advertising that, and is also told even via email that the amiibo is, in fact, from the US when it most definitely is not. Very unhappy customer right now."
            },
            {
                "review_posted_date": "12 Dec 2014",
                "review_author": "Jason",
                "review_header": "Impressive detail, but what else can I do?",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "When I bought Smash Bros I was aware of these but I had no idea what they did, to be honest I still don't know if I know everything they do so far. The way I have been using them is to have them assist me on 2v2 battles. Training was easy, in fact a little to easy. I had my amiibo fight in two very long battles and it was maxed. Personally I think it would be more rewarding if it was much tougher to max them out, but that's just me. As for the looks of it as a figure it is pretty well done. There is a lot of detail, I just hate that yellow bar and as far I can tell there is no way to remove it and paint it a better color. Overall I think these are pretty cool. I am sure down the line there will be more to do with them."
            },
            {
                "review_posted_date": "26 Mar 2015",
                "review_author": "Reanne",
                "review_header": "Very nice",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "Very nice figure. Sheik is a great character, and this figure has lots of nice detail. I'm very impressed at the quality for this price point. Even if I didn't have a WiiU (I do), I might pick this up just to have it as a figure. As far as the compatibility with games, I don't play Smash Bros. much, but it's nice that I can get a pretty decent weapon each day in Hyrule Warriors. So far, though, they've only been weapons for this character, which is a bummer. (This is the same as with my Zelda amiibo, so I suspect this is a normal restriction.) Would be very nice if I could collect weapons for non-amiibo-having characters this way. (I took one star off my review because of this.)"
            },
            {
                "review_posted_date": "21 Nov 2014",
                "review_author": "Sakura x Juri",
                "review_header": "Don't expect too much from it",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "Well there are multiple uses for an amiibo other than using it for super smash. On the packaging(and on the amigo information page on the WiiU) it tells you that an amiibo will be used for different games. I also heard that they are working on tweaking it to be used for Hyrule Warriors, but I'm not 200% certain. You cannot train the amiibo yourself(in super smash) it's pretty much like an AI that levels up to 50 that you can customize skills, clothing color and name. In order for it to level up you must use it as your teammate(this is the only useful thing about it so far). I don't care too much for all that right now, I'm using my Link as an action figure since I collect those. He is very well detailed and worth collecting."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "10%",
            "2 star": "1%",
            "5 star": "84%",
            "1 star": "2%",
            "3 star": "3%"
        },
        "url": "http://www.amazon.com/dp/B004U5FPXS",
        "price": "$19.99",
        "name": "Skip Hop Zoo Toddler Kids Insulated Backpack Edi Elephant Boy, 12-inches, Blue",
        "reviews": [
            {
                "review_posted_date": "20 Aug 2015",
                "review_author": "BevI.",
                "review_header": "My daughter and I loved them. We got the bag and lunch bag",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "My daughter and I loved them. We got the bag and lunch bag. Perfect for Pre-K. So cute I had to put her name on the bags."
            },
            {
                "review_posted_date": "06 Dec 2012",
                "review_author": "Murphy Lane",
                "review_header": "As a diaper bag it holds enough for a simple outting!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "**Update** Aug 7, 2015 We still regularly use this bag if we're planning to be away from the house a while. We've tossed it in the wash several times; it has minimal fading and we have never encountered color bleed. We regularly stash race cars/tractors, crayons, small books, a sippy cup, snack, and change of clothes. Definitely a cute and worthwhile purchase! **Original Review** I only bought this because I wanted to try a different bag (thinking out of the box, er, bag here) than the gigantic Jeep Weekender bag we have now. Diaper bags are like purses, the bigger they are the more stuff you feel you need to put in it! When I first got this Skip Hop pack I immediately agreed with other reviewers that it was way too small. HOWEVER, once I tried it out and put everything in it we'd need for a simple 2-3 hr outting, I found that SURPRISINGLY, everything fit just fine! Inside, I packed an extra outfit, a changing pad, a ziplock with crunchies, a ziplock with one stage 3 jar, one baby yogurt and a spoon, links with toy attached, and a wubbanub. Front pocket easily holds two diapers (maybe up to 4), small pack of wipes and a tube of diaper rash cream. Side pocket holds only a single bottle though. So far thats the only downside if you're planning to use this bag for an infant. Which is why I say it's good for a short outting. I haven't used it yet so I may have to update this review in a bit. I love it right now though! Hope this was helpful!"
            },
            {
                "review_posted_date": "20 Jun 2016",
                "review_author": "JMCress",
                "review_header": "Perfect for toddlers, but not for preschool",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "These backpacks are so cute! My daughter absolutely loves her little ladybug backpack. It is the perfect size for a toddler to be able to carry a few things in. She loves to put some of her toys and dolls in the backpack and carry it around the house. It’s also really useful for packing toys and snacks when we go on road trips. My only complaint is that it doesn't quite fit a regular 8.5x11 paper or notebook. This makes it not as great for my daughter to take to preschool, but we will probably make due instead of having to purchase a second backpack. If you found this review helpful, I would very much appreciate you giving me a \"thumbs up\". And if you have any questions, I'd be more than willing to answer them to the best of my ability!"
            },
            {
                "review_posted_date": "06 Aug 2016",
                "review_author": "Blessed Hot Mess",
                "review_header": "Quality has changed",
                "review_comment_count": "",
                "review_rating": "3.0 ",
                "review_text": "I'm conflicted here. We previously owned the giraffe Skip Hop backpack and it took a beating for 2 years and only had minimal wear. I was excited to get this one as a replacement but was immediately disappointed in the quality. I compared them side-by-side and this one is definitely flimsier. The material is thinner and it just doesn't feel as sturdy. As a matter of fact, I wondered if I received a counterfeit and double checked that I ordered directly from Amazon (an authorized dealer). I guess Skip Hop has just lessened their quality for the new backpacks. I hope this one holds up."
            },
            {
                "review_posted_date": "14 Aug 2015",
                "review_author": "Amina",
                "review_header": "Five Stars",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": ""
            },
            {
                "review_posted_date": "28 May 2017",
                "review_author": "Michael",
                "review_header": "It's fine, and better than most alternatives.",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "I've seen a lot of toddler backpacks at preschool. I think this is one of the better bags, but there are issues. First, it does not contain the similarly-styled lunchbox at all, and latching them together via the top loop is awkward. Second, the side pouches are basically useless for any normal-size water bottle, or really anything since kids tend to toss around their bags. The outer zip compartment is too big to hold little things, and too small to hold a change of clothes or anything useful. The straps are not super comfortable for a kid, and I think a sternum strap would be both fun for a kid, and more comfortable, and likely for them to keep it on for more than a few minutes. The large leaf zipper pull is a nice touch. Having two zippers, so the top can be opened, would have been nice. I think they just didn't really design or test this much or enough on 2-3 year olds. The insulated pouch for snacks -- is NOT insulated. So I think this is better than a lot of alternatives, and it's cute. And you could do well to buy it, but I do NOT love it."
            },
            {
                "review_posted_date": "22 Jun 2015",
                "review_author": "Shawn",
                "review_header": "Great for little girls",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "My daughter absolutely loves this backpack. It is super cute and the perfect size to hold all her treasures."
            },
            {
                "review_posted_date": "13 Mar 2017",
                "review_author": "Becky",
                "review_header": "Adorable and Durable",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "LOVE this backpack! It's cute, and my son LOVES taking a backpack to \"school\" every morning just like his big sisters. He even hauled it across the Chicago airport on his own at Christmastime--and he was only 18 months old! It's just his size and fits a lunchbox, a change of clothes perfectly, with room for a couple little toys, a pair of shoes, a lovey, or his winter hat, as well. Great quality with large zipper pulls so he can zip it himself. Holds its shape well, so it's easy for him to set it down and put things in it. Definitely a good buy. Glad I bought it."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "12%",
            "2 star": "2%",
            "5 star": "70%",
            "1 star": "7%",
            "3 star": "9%"
        },
        "url": "http://www.amazon.com/dp/B0067N91V8",
        "price": "$4.93",
        "name": "Rhode Island Novelty Classic Gag: Squirting Wee Pee Boy Squirter Quantity of 1 Novelty",
        "reviews": [
            {
                "review_posted_date": "07 Jan 2016",
                "review_author": "PrimeAddict",
                "review_header": "that thing is funny, I wonder if its on amazon",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Ordered this while drinking mai tai's at the hibachi restaurant. I said to my girlfriend, that thing is funny, I wonder if its on amazon, and sure enough it was and now whenever she cooks I grab it off the counter, squirt her with it and yell \"Fire man fire man!!\" Family and guests think I'm weird, I think it's hilarious."
            },
            {
                "review_posted_date": "31 May 2013",
                "review_author": "kellyjlo",
                "review_header": "Potty doll for boys toy",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "So I searched and searched for a reasonable doll for boys to assist in potty training. I have used \"Total potty training in a day\" with my daughter and it worked like a charm! (AMAZING) so being a boy, I know things are different down there so to help with the visual part, I thought this could help. Its totally cute and funny and pees like a foot long stream several times before needing to be refilled. I also bought the potty princess with poop in the potty. We havent started the actual process as the book describes but this is one small step for little boys. Cute joke toy also...we laughed and laughed. Thats the trick with potty training...to be fun!"
            },
            {
                "review_posted_date": "26 Feb 2016",
                "review_author": "Jennifer",
                "review_header": "Gag gift - perfect for my 7 year old boy",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "The local Japanese steakhouse uses one of these to put out the fire on the grill (as a joke). Since my 7 year old son thinks this is hilarious, we decided to get him one as a gift. He loves it and plays with it for a few minutes at a time. I'm not sure how durable it is, but definitely a cute gag gift with some play-ability."
            },
            {
                "review_posted_date": "26 Feb 2018",
                "review_author": "L. A. Panfil",
                "review_header": "Got this for my daughter since she liked one just like it when she was little",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Got this for my daughter since she liked one just like it when she was little. Her gramma had one an all the grandkids loved it till it broke. After they passed they didn’t remember it broke an wanted it as a memory"
            },
            {
                "review_posted_date": "22 Jun 2017",
                "review_author": "Rocky140",
                "review_header": "Great for outdoor hibachi grills",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "We have a griddle on our backyard porch where we often make fried rice for the kids. Bought this for my husband to use and give the kids a few laughs just like they do at hibachi restaurants. Works great and the kids absolutely LOVE it. Hilarious and fun!"
            },
            {
                "review_posted_date": "22 Oct 2016",
                "review_author": "Ryan Sleight",
                "review_header": "Potty training genius",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "This toy is so fun for a potty training boy! He wants to make it pee all the time and it's a great teaching tool to keep pee in the potty target than making a 'mess'."
            },
            {
                "review_posted_date": "24 Mar 2015",
                "review_author": "Amazon Customer",
                "review_header": "Works as expected",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Sent it to my mom for Xmas cause she's a nerd and loves gag gifts. She liked it a lot, she gets unsuspecting people to pull the pants down, and god knows what they expect to happen, but I think it's fair to say they are usually surprised. She says it squirts pretty far, like 3 feet+. I haven't seen it myself since I live far away, but i can say my dorky mom loves it."
            },
            {
                "review_posted_date": "13 Sep 2017",
                "review_author": "snazzy frazzy",
                "review_header": "Squirting Wee Thing",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "This is brilliantly hysterical yet sublime in its subtle approach to humor. Not quite slapstick in a kitchy Three Stooges approach to comedy, but for more instrinsically pure. And I think its a pig, so makes it even funnier. Pluses for shooting very far, go range, good capacity can hold a lot of water. Very accurate.Pants are spring loaded, so very smooth action. No grit or snap when the trigger breaks. easy to fill. Looks built to last and has a timeless style so will stay fashionable. Paint looks very durable."
            }
        ]
    },
    {
        "reviews": null
    },
    {
        "ratings": {
            "4 star": "12%",
            "2 star": "3%",
            "5 star": "73%",
            "1 star": "6%",
            "3 star": "6%"
        },
        "url": "http://www.amazon.com/dp/B004LRBLSI",
        "price": "$3.67",
        "name": "Shoreline Marine Emergency Survival Whistle",
        "reviews": [
            {
                "review_posted_date": "28 Feb 2014",
                "review_author": "wny-rider",
                "review_header": "Super loud without a lot of effort",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "We purchased 3 of these for everyone to carry. We participate in a lot of outdoor sports and needed an emergency signalling device that was small, failure resistant and powerful. These do not have the pea inside, so they won't fail if wet or frozen. The other consideration was how loud with little effort. If you are injured, it wouldn't be easy to get a great big puff to fire off the whistle. It's quite audible with a little exhale, and super loud if you can really blow. We carry these when we snowmobile in case someone is lost or slides down a hill or out of sight. A great piece of mind for very little $$$'s"
            },
            {
                "review_posted_date": "08 Jan 2018",
                "review_author": "I only have pies for you",
                "review_header": "Blow your whistle with caution in a zombie apocalypse",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Bought this for my disaster kit, since it seems that a whistle is a must-have item according to the Ready gov site. It seems pretty sturdy, and is pretty loud as any good whistle should be. Although, everyone knows that zombies are attracted to loud sounds, so while I may be heard loud and clear when I am signaling for help by blowing on this whistle, I may also be drawing unwanted attention to myself in a zombie apocalypse :)"
            },
            {
                "review_posted_date": "14 Sep 2016",
                "review_author": "David F.",
                "review_header": "Awesome Safety Item",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "A great loud whistle. No pea or ball in this which is what I was used to with whistles not that it was a problem. As a matter of fact I like it that it doesn't have anything inside it. This has a long lanyard and is perfect for emergencies. I also think it is a great item for anyone to have especially for the women who go shopping by themselves or at night. A blow on this whistle will send anyone away and draw attention. I rate this a 10+ for a safety item. At $2. and change every family should own a few of these."
            },
            {
                "review_posted_date": "19 Jul 2013",
                "review_author": "Gardener",
                "review_header": "Just what I wanted.",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I live in an area where we often see black bears in our yard. I wear this light weight whistle whenever I go out to do my gardening. The bright orange color makes it easy to find if I should inadvertently put it down."
            },
            {
                "review_posted_date": "16 Mar 2015",
                "review_author": "Super2018",
                "review_header": "Works great!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "+ Bright color + Sturdy lanyard + Nice and loud + Small so I can carry in my pocket or running hip pouch + Inexpensive...so I bought one when I'm on runs and a dog decides to come after me or when I'm at the dog park and agressive dogs get into it (loud noise like whistle or air horn does wonders). Also got one for my daughter to carry with her for emergencies. My boys already had one from boy scouts as a whistle is a great survival tool when you're off hiking. Only improvement is the metal ring that attaches lanyard to whistle could be a slightly better quality, but since this was only $1.64 at the time, I'm not deducting stars"
            },
            {
                "review_posted_date": "30 Sep 2016",
                "review_author": "Mickey White",
                "review_header": "Super loud and a lifesaver!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I bought this whistle to use on my kayaking trips on the intercoastal in South FL where there are many boating channels where boats and jet skis fly by at high speeds. This has come in handy almost every time, as there tend to be some careless boaters out there and this inexpensive, loud level of protection is a must have for anyone in this position. My wife is also a lifeguard for hire and she has used it during her jobs. The decibel level produced has he keeping the pool on lockdown with little to no effort! All around, must have for any occasion!"
            },
            {
                "review_posted_date": "13 Sep 2016",
                "review_author": "Stephen T.",
                "review_header": "Thinnest, cheapest plastic ever.",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "This is the worst made whistle. The cheapest plastic, which nearly even snapped as I tried to blow on it. Made in China... in the worst possible way. Does not match the picture, so something is wrong here."
            },
            {
                "review_posted_date": "13 Feb 2013",
                "review_author": "Capt. T",
                "review_header": "It's a safety whistle and it is cheap",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "This safety whistle works and is cheap, so what is not to love? It seems to be made well, so for the price, I'd say it is hard to beat."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "7%",
            "2 star": "1%",
            "5 star": "88%",
            "1 star": "1%",
            "3 star": "3%"
        },
        "url": "http://www.amazon.com/dp/B0002F7B32",
        "price": "$75.51",
        "name": "Remo KD-0500-01 Kids Percussion Frame Drum Pack - Fabric Rain Forest",
        "reviews": [
            {
                "review_posted_date": "17 Apr 2017",
                "review_author": "A. A. Nastold",
                "review_header": "Which one do you buy?",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I didn't know which one to buy and went with the cheaper \"rhythm kids\" drum. With that one you get one drum \"stick\" and the drum sound is not good, so I bought the other one. With the more expensive \"rain forest\" (taller and more expensive) drum you get 2 mallets and the drum sound is much richer; there is really no comparison. As an adult I enjoy playing the rain forest one but would never play the cheap sounding rhythm kids drum. The difference isn't only the mallet instead of the stick, the drum head is a far superior quality. I want to buy other remo kids drums but am afraid I would just get the tinny sounding drum head. The 5 star is for the rainforest only, rhythm kids gets 3 stars."
            },
            {
                "review_posted_date": "10 Jul 2014",
                "review_author": "Sharon",
                "review_header": "LOVE Remo Kids",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "My baby loves it!!! He's had this since 8 months old, and has been beating on it constantly. By around 1 years old, he turned it upside down and slid in it butt first.... He played a little in there and then when hr realized he couldnt get out, he starting frowning and building up a cry!~ He wasn't hurt as I was watching him closely. It was too cute not to snap a pic. See picture posted! LOVE Remo Kids!!! UPDATE: 03/03/2015 at 22 months he is still playing with it. He now hits on it with his hands while daddy plays guitar. Sometimes he hits it on the right beats..... On a side note, I had to stop him from stepping on it a couple times. I also had to muffle it a bit with a small blanket because he is bigger with stronger arms and with the mallet it could get quite loud. I just really don't want to disturb my elderly neighbors. UPDATE : 02/7/2018 This drum is still an essential part of my my childs playroom! He is 4.5years old and now, he could actually play nice beats to troll songs! Please invest couple dollars more and get the one with two mallets! Tried the other version and you could tell the difference in the sound quality! I have been gifting this along with hohner kids xylophone for all 1 year birthdays! Just an awesome product that grows with your kid!"
            },
            {
                "review_posted_date": "09 Jul 2014",
                "review_author": "D. Coral",
                "review_header": "Has annoying resonance",
                "review_comment_count": "",
                "review_rating": "2.0 ",
                "review_text": "I was a rock musician during the fun days, so I know what a decent drum is supposed to sound like. Kids won't know the difference, but this drum has an annoying metallic sounding resonance, somewhat like hitting a large tin can. I purchased this based on the raving reviews, and it is completely puzzling how so many people would miss mentioning the resonance (are all the reviews real?). I know this is a kid product and not for professionals, but the product description talks about the \"enhanced low-pitched fundamentals.\" The drum sticks are nice though. I will try the larger diameter Remo Kids gathering drum to see if perhaps those don't have the ringing overtones."
            },
            {
                "review_posted_date": "19 Sep 2015",
                "review_author": "Denise",
                "review_header": "Great, but not as pictured!",
                "review_comment_count": "",
                "review_rating": "3.0 ",
                "review_text": "I love the drum, but it is NOT as pictured.. mine has a thick sticker on the inside that is impossible to remove, and it can be seen from the outside as well!"
            },
            {
                "review_posted_date": "30 Dec 2016",
                "review_author": "Bryan Wynacht",
                "review_header": "Great BANG for the buck!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I bought my 20 year old one of these drums when he was three. It's lasted, unscathed, through my son, my other kids, nephews, neighbors, etc... So when it came to searching for a gift for my current three year old I was excited to find Remo still made these. I bought him this massive 22\" version to go along with the smaller drum I bought my older son. This thing is amazing! So much BOOM and the kids love it. It's constructed just as solidly as the twenty-year old drum, maybe even improved. I would recommend these drums to anyone."
            },
            {
                "review_posted_date": "27 Aug 2010",
                "review_author": "Cheryl Magiera",
                "review_header": "Come with 2 mallets!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I bought an extra mallet at the same time as I bought the drum because there was only one pictured. It was not clear to me. The drum actually comes with two mallets so no need to buy an extra!"
            },
            {
                "review_posted_date": "02 Feb 2018",
                "review_author": "M. Thomas",
                "review_header": "Solid quality build and sound for the price",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "My 18 month year old loves it and has been using it daily for a couple of months. The build quality has held up to tons of hitting, standing/sitting/dancing on, rolling around from room to room and other exploratory toddler actions. The note is tuned lower than standard \"children's instruments\" and is therefore a lot more pleasing to listen to every day. I highly recommend this drum for children and adults of all ages. This is from someone who has been a drummer/musician for 26 years."
            },
            {
                "review_posted_date": "16 Mar 2014",
                "review_author": "Idle Wild",
                "review_header": "Pow Wow WOW !!!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "i bought this on sale for my son who turned one. i watched it for a long time and sprung for it when the price dipped down to sixty four bucks. i am so glad i bought this! we have the remo kids bongos, floor tom, and konga drum, and the lollipop hand drum and tambourine. we like hearing our three kids bang around. i would highly recommend this. it is pretty loud, of course. but you can put a pillow under it if you are getting a headache (LOL) and that helps a lot. either way, the sound is great- booming, naturally. but it sounds high quality and resonates well, not cheapo or tinny. it's like a pow wow drum. my husband really likes it too. we love to drum around some, even though we aren't serious drummers, there is something quite therapeutic about pounding on a drum. it is huge, almost two feet across. which makes it great for sharing as two or three kids can easily sit around it. the mallets are nice and my baby loves banging on it with them, it is easy for him to grasp them and bounce them off the drum and it sounds great. and he thoroughly delights in it, which is all i ever wanted :) this drum is awesome. worth every penny and i am thrilled i got it on sale, i think it was a bargain. seems very high quality and durable. i think this will last beyond my children and i look forward to keeping it for young and old, many years to come."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "9%",
            "2 star": "2%",
            "5 star": "83%",
            "1 star": "2%",
            "3 star": "4%"
        },
        "url": "http://www.amazon.com/dp/B00006IEEU",
        "price": "$8.91",
        "name": "Prismacolor Premier Colored Pencils, Soft Core, 24-Count",
        "reviews": [
            {
                "review_posted_date": "20 Aug 2015",
                "review_author": "Sophie",
                "review_header": "they are AMAZING, well packaged",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I bought this 150 set of Prismacolor pencils before about 2 weeks now and did some drawings . so first of all it is AMAZING soft , blend easily and the result is great . about the breaking issue honestly I sharpened many colors of the set many times and it didn't break not even once . a tip before you start using your set take a hair dryer and try to move the heat all over the pencils then leave them for 15 to 30 minutes to cool down . this way you will avoid any breaking issues while sharpening your pencils . I definitely recommend prismacolor pencils for anyone who loves to draw"
            },
            {
                "review_posted_date": "29 May 2015",
                "review_author": "Piper",
                "review_header": "Fantastic!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "This is a great set. Prismacolors are worth the praise they always get. They are creamy and smooth. I've had no breakage and they come in a nice tin. I think they are vivid and blend very well. It comes with a good variety of colors for a 24 pencil set. I highly recommend these!"
            },
            {
                "review_posted_date": "18 Sep 2015",
                "review_author": "Buttercup",
                "review_header": "Great colors!",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I am 200% amazed by the outcomes of these great colors. They are very easy to blend and layer. When I first opens the box, the pencils looked so ordinary that I was a little sad. But after I used them to do some work, they surprised me. The colors are incomparable to those cheap pencils I used to have. It seems that the pencil itself knows how to read my mind, lol! It works with me! I don't have any broken lead issues at all. It was sitting on the platform when I got home. It was very hot from the hot summer weather. I put it in fridge for like 5 minutes before using it. It consumes fast, though. I need to constantly sharp it to get the wanted details. The Prismacolor scholar pencil sharpener is what I use to sharpen it. It works perfectly. Here, I added a picture of a black kitty I drew on an A4 size sketch book. It cost me a little more than half an inch of the black color pencil. I will definetly buy a delux of 150 colors later when I have more pocket money. All in all, 5 stars! Highly recommend it!"
            },
            {
                "review_posted_date": "07 Oct 2016",
                "review_author": "Danni",
                "review_header": "150 MISTAKES...",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "With all due respect to the glowing reviews for this product, I must respectfully weigh in here. I've used Prismacolor Premier colored pencils for the past 25 years. Having recently purchased a large set for my older daughter on Amazon, I can say with 100% confidence that this brand has declined STEEPLY in quality. I compared my old set of 72 with her new set, and even being considerably older than my own child, the original Prismas are distinctly higher in quality. Her new set came with SERIOUSLY off-centered leads, wooden shafts that are either cracked or completely different colors from one half to the other, and most concerning, the cores in many of the pencils seems to be waxier and clumps/flakes no matter what we do. I even found one pencil stamped with a misspelled color name; not a deal-breaker in and of itself, but clearly another indication of the level (or lack thereof) of quality control. I believe that many of the higher reviews for this product are from before the company began cutting corners...a search online will quickly reveal that cracked wood, broken leads, off-centered cores, and other issues have been present for several years now. I'm not new to these pencils; I know every trick in the book for sharpening, warming the cores, and handling them with care. Notwithstanding, when the product arrives damaged (after I paid for overnight shipping to reduce the amount of jostling/handling they'd otherwise receive), it's disheartening at best. I contacted Prismacolor directly about this issue, and was told that if I sent them photos of some of my damaged pencils, they would send me a return mailing label with which I could send back the set. And then I could wait seven to 10 business days, as another set was sent from Mexico to Tennessee, and then ultimately back to me. While I appreciate the offer to replace them, I see no point in going through all of that in order to get the same product AGAIN, this time with additional transit concerns and no guarantee that the pencils would be any better than what I currently have. There's no disputing that Prismacolor has chosen to make some changes to their production, be it in quality control, materials, manufacturing, or all of the above. Their steep decline in pricing reflects that reality; a 72-count set used to run more than $1 per pencil, and now sells for half that price. I almost NEVER write reviews on Amazon, but felt strongly that if someone could avoid my costly mistake it would be worth it; maybe if more people did the same, the people manufacturing Prismacolors would bring back the \"Premier\" that once made them such a great product."
            },
            {
                "review_posted_date": "30 May 2015",
                "review_author": "Fun Times Mom",
                "review_header": "Nice large set... But I ended up buying an even larger set! ;) Save time, go with the 132 ct at least..",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "Here is what the 72 count set of colors looks like... Unfortunately, I didn't think of taking a picture before I bought 3 more pencils individually. The ones with the check marks in front of the set were the 3 additional ones that I bought. These are great for layering and shading. I bought a 36 count of the Prismacolor Verithins for darker lines. They work well together and each one has it's own purpose. I'm not an artist just an adult that has picked up coloring before bedtime to relax. I only wish that I would have bought one of the larger count sets since I am always looking for additional colors. If you are having challenges with sharpening them there is a you tube video about it and how you should always turn the pencil, not the sharpener, in the same continuous direction. Don't be wobbly or rotate back and fourth. There were even explanations on how many you should put into an electric sharpener and then manually sharpen one because they overheat and break the leads! Even to follow up a couple of colored pencils that have been sharpened with a graphite one to lubricate the gears again! Wow, I had NO Clue why electric sharpeners seemed to sometimes work and then not.. It makes perfect sense now! (Very important to know if you have an entire set that needs to be sharpened like the Verathins... )! There were also recommendations regarding pencils that have leads that seem to be broken within, warm them up in the sun a little bit before you sharpen.. You'll have a whole new solid lead from within on e the wax melts together.. Problem Solved! I've included a picture of the Verathins 36 count set and a 48 count set of Marco Raffine for anyone curious of the differences. There are pictures of the 50 count Prang set vs the 50 count Crayola set on the 50 count Prang review of mine. I provided a picture of the colors in the 132 count set in the last picture. The entire template is colored, just some of the colors aren't showing up well in the picture. FYI"
            }
        ]
    },
    {
        "ratings": {
            "4 star": "11%",
            "2 star": "4%",
            "5 star": "73%",
            "1 star": "8%",
            "3 star": "4%"
        },
        "url": "http://www.amazon.com/dp/B00ECHYTBI",
        "price": "$165.99",
        "name": "Infant Optics DXR-8 Video Baby Monitor with Interchangeable Optical Lens",
        "reviews": [
            {
                "review_posted_date": "29 Oct 2015",
                "review_author": "Lando",
                "review_header": "This camera and monitor are great and the costumer service is even better.",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "We have been using the Infant Optics DXR-8 video monitor for 1 year now and felt we could now give an accurate review. If you're in a hurry, the summary of this review is that this camera and monitor are great and the customer service provided by the company is outstanding (see below). So stop hunting and trying to weigh all the baby camera/monitor reviews and get this camera and monitor if it provides you with all the features you want. You really aren't going to find anything better. We initially purchased this camera and monitor after spending way too much time pouring over all the options available to us, trying to find the BEST camera and monitor for our new baby. Our main concerns were getting a good camera with quality night imaging, good sound and an easily viewable monitor. We also felt we didn't want a system that sent our image feed off to some remote server where it would be stored for some period of time for whatever analytics that the company performed. The Infant Optics DXR-8 fulfilled all our wishes. Set-up: Setting up the monitor and camera was easy. We followed the directions and had no issues at all pairing the camera and monitor. The camera was actually very light and we hung it up on the wall so it could capture the entire inside of the crib. Again, it was very easy. USE: The monitor had a clear picture in day light and more importantly, at night. The monitors range was sufficient for us and we had no problems even after we moved baby out of our room and into her own as our rooms were on different floors. The monitor always worked great and we could always see the baby when we wanted. The controls on the monitor were easy to use and the buttons were large enough to use in the middle of the night with no light or light from monitor alone. We appreciated the simplicity, particularly when sleep deprived. In terms of battery life for the monitor, we had no issues once we figured out our schedule. We used it pretty much throughout the day unplugged and kept it plugged in overnight night by our bed, pretty much like our phones. Occasionally we ran out of battery but not frequently enough where we thought there was something wrong. It was all we could ask for. Customer Service: Now for the best part. Coming up on a year of use, the power button on the monitor began to stick. We started having issues turning the monitor on and off and putting it to sleep. It got to the point where the monitor turned on and off by itself sporadically which was problematic at night. We wrote an email to Infant Optics explaining the situation and hoping for a repair or replacement. We received a response on the very same day we wrote (Sunday!) explaining that a replacement monitor would be easiest. So we sent the monitor back through the mail and sent them a picture of the package and the receipt. Given this proof, they were able to send out our replacement before they received our broken monitor and we received the new monitor in the mail in 2 days! But that’s not all. We accidentally sent back the battery for the monitor which we were instructed not to do (The monitor still works without a battery if plugged in). So we wrote again explaining our mistake. Infant Optics immediately got back to us again and sent out another battery for the monitor. 2 days later we had a new battery for our new monitor. Conclusion: Honestly, we could not ask for better treatment. This is the type of costumer service that actually makes you happy and reaffirms that the Infant Optics camera and monitor was the right choice for our family. You can’t go wrong with this camera and monitor. It works great and it is backed up by outstanding customer service that provides peace of mind all new parents should be afforded."
            },
            {
                "review_posted_date": "02 Mar 2016",
                "review_author": "Michael Marshall",
                "review_header": "Side-by-side comparison of the Samsung SEW-3043W and Infant Optics DXR-8",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Side-by-side comparison of the Samsung SEW-3043W and Infant Optics DXR-8: First, I just want to say that I am an actual customer that purchased both of these knowing that I would be returning one. It is our first baby together, and we wanted to make sure we had the best possible monitor. The mommy-to-be and I wanted to test both of these units side-by-side to see how they compared to each other. Samsung initially seemed like the better choice as it had the 5” screen compared to the DXR-8’s screen of only 3.5” The Samsung also had music playback on the camera in the baby’s room (4 different lullaby song choices), and a small night light on the top of the camera (which you can turn on and off). However, when it came to actually functionality, the DXR-8 was by far the BETTER choice. The on-screen touch controls of the Samsung lagged and were difficult to use. The Samsung’s touch screen is far different than the touch screen on their cell phones, their touch screen has little sensors throughout that you can see if you look at it closely. The Samsung also went out of range (as noted in many of the pictures) when compared to the DXR-8. In one picture I took both units outside. The DXR-8 went over 200’ from my house (and probably could have gone much further). The Samsung went out of range before I even got out the door. The Samsung unit failed at three different areas in my house. Trust me when I tell you that I didn’t make the test easy either. I had three doors shut and about four walls separating the handheld units from their cameras. I took them throughout the house, side-by-side, at the same time. Save yourself both time and $$$ and just start with the Infant Optics DXR-8. Additional pros of the DXR-8 include the on-screen temperature display of the baby’s room, and a brighter display (the Samsung display was rather disappointing, I thought it would have been the far better display, but it simply was not). The only con of the DXR-8 is the smaller screen size, but it is sufficient. Both units functioned about the same when it came to night vision."
            }
        ]
    },
    {
        "ratings": {
            "4 star": "11%",
            "2 star": "3%",
            "5 star": "78%",
            "1 star": "5%",
            "3 star": "3%"
        },
        "url": "http://www.amazon.com/dp/B01H1R0K68",
        "price": "$7.99",
        "name": "ThermoPro TP50 Digital Hygrometer Indoor Thermometer Humidity Monitor with Temperature Humidity Gauge",
        "reviews": [
            {
                "review_posted_date": "14 Jan 2017",
                "review_author": "R. Tuttle",
                "review_header": "The accuracy of this hygrometer is terrible. It consistently reports humidity at almost 20% below ...",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "The accuracy of this hygrometer is terrible. It consistently reports humidity at almost 20% below the correct reading. Attached is a photo of the ThermoPro along with two other hygrometers - the Planet Waves brand shown in the photo was designed for keeping in an acoustic guitar case, and the other is a more expensive Peak Meter model. As you can see in the photo the ThermoPro reads 10% while the mid priced Planet Waves device reads 27% and the more expensive Peak model reads 28.1%. Over the course of a week the measurements of the ThermoPro varied from between 10% and 20% below the other devices (which always remained within 2% of each other). Don't waste your money if an accurate reading (as opposed to a relative reading) is important to you. This devices proves that you get what you pay for."
            },
            {
                "review_posted_date": "18 Oct 2016",
                "review_author": "J. Chin",
                "review_header": "works well for the price, but not 100% accurate",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "Love them. They serve their purpose and for the price. However, they are not the most accurate ... could be off by a degree or two (see photo of the 3 that I bought, after 10 minutes, sitting side-by-side)."
            },
            {
                "review_posted_date": "22 Dec 2016",
                "review_author": "GoneCarping",
                "review_header": "I have about 10 Acu-rite hygrometers which are all fairly ...",
                "review_comment_count": "",
                "review_rating": "1.0 ",
                "review_text": "I have about 10 Acu-rite hygrometers which are all fairly accurate, but I preferred the design of this Therm Pro. Sadly, while the temperate is correct as compared to my Acu-rites, the humidity is 15%+ off (Always reads too low) as compared to an array of Acu-rites. Not eligable for return, so I'm stuck with a worthless hygrometer (that happens to tell an accurate temp, though not why I bought it!)"
            },
            {
                "review_posted_date": "28 Jan 2018",
                "review_author": "Paul Kolodner",
                "review_header": "Accurate and easy to read",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "I am a physicist with a new zone in my forced-air heating system and a piano that needs to have constant room humidity, preferably around 42%. I bought three of these monitors to assess these conditions. The first thing I did was to enclose them in an transparent, air-tight container with three other humidity monitors that I have been calibrating for years. I put the container next to the room thermostat and noted the readings 8 times over the course of 30 hours. I opened the container twice to let in air with a new humidity. Here’s what I observed: 1. The readings stabilized within about an hour or two after each time I opened the container. 2. The 3 new monitors agreed with each other to within about 0.5 °F and with the thermostat reading. This is more than good enough for me to use to assess the uniformity of the temperatures in the different rooms of my new heating zone. 3. Their humidity readings agreed with each other to within 1% RH. That’s excellent – but possibly inaccurate. 4. Comparing the humidity readings with my careful calibrations of the other humidity meters, I concluded that the humidity readings of these new monitors are about 2% higher than the true humidity – at about 42% RH. That is excellent. Therefore, I scientifically conclude that I am happy with this purchase!"
            },
            {
                "review_posted_date": "17 Jan 2017",
                "review_author": "Tom Barrister",
                "review_header": "Works as advertised",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "UPDATE: The first hygrometer regularly listed the temperature higher and the humidity level lower than my other thermometers/hygrometers. It was promptly replaced by the company. The replacement works correctly. This hygrometer measures temperature and humidity, and it's meant for indoor use. It operates on one AAA battery, included with the device. The device has a small kickstand that sets the device upright at an easy-to-read angle and also had a magnet so that it can be attached to a metal surface such as a refrigerator. The temperature reads in tenths of a degree. Note that the hygrometer may take an hour or so to adjust itself to its surrounding conditions, and temperature and humidity readings may be slightly off initially. Also be aware that handling the device also will change the reading temporarily, due to body heat and moisture being in contact and/or proximity."
            },
            {
                "review_posted_date": "28 Oct 2016",
                "review_author": "Lindsay Fox",
                "review_header": "This product is perfect for my needs",
                "review_comment_count": "",
                "review_rating": "5.0 ",
                "review_text": "This product is perfect for my needs! I'm using it inside of my indoor greenhouse, which has humidity as high as 95% at times, and an average temperature of 80 degrees (F). Other monitors I've tried in the past died on me after a few days from what I'm guessing is the high humidity environment, but this one is still going strong. The accuracy seems to be on point as well. Love the small size with large font too so I can see it from a distance without taking up too much space!"
            },
            {
                "review_posted_date": "01 Feb 2017",
                "review_author": "Bardo",
                "review_header": "The design of the unit is nice, I especially like the magnet on the back",
                "review_comment_count": "",
                "review_rating": "4.0 ",
                "review_text": "Initially, this unit showed 10% humidity and would not budge, even as we had it placed next to a Humidifier. We were experiencing dry skin and chapped lips, so it's possible that the humidity level was that low, but unlikely. However, after several days it finally began to creep up and now displays what we believe to be the correct value. (30-35%) The design of the unit is nice, I especially like the magnet on the back. And at $8, the price really can't be beat. The comfort level indicator is set too high and no way to change that. 40% is perfect for a home, but this unit will say it's too dry. Above 60% and you're likely to be dealing with mold issues, but this unit will still say comfort until 70%. Dry should be under 30%, Wet should be above 60%. But I just ignore that portion of the display."
            }
        ]
    }
]